///数据字典
//dcm  2012-7-19
//省市
// JavaScript Document
var JsonProvince = [{ "id": 0, "name": "全国" }, { "id": 1, "name": "安徽" }, { "id": 2, "name": "北京" }, { "id": 3, "name": "福建" }, { "id": 4, "name": "甘肃" }, { "id": 5, "name": "广东" }, { "id": 6, "name": "广西" }, { "id": 7, "name": "贵州" }, { "id": 8, "name": "海南" }, { "id": 9, "name": "河北" }, { "id": 10, "name": "河南" }, { "id": 11, "name": "黑龙江" }, { "id": 12, "name": "湖北" }, { "id": 13, "name": "湖南" }, { "id": 14, "name": "吉林" }, { "id": 15, "name": "江苏" }, { "id": 16, "name": "江西" }, { "id": 17, "name": "辽宁" }, { "id": 18, "name": "内蒙古" }, { "id": 19, "name": "宁夏" }, { "id": 20, "name": "青海" }, { "id": 21, "name": "山东" }, { "id": 22, "name": "山西" }, { "id": 23, "name": "陕西" }, { "id": 24, "name": "上海" }, { "id": 25, "name": "四川" }, { "id": 26, "name": "天津" }, { "id": 27, "name": "西藏" }, { "id": 28, "name": "新疆" }, { "id": 29, "name": "云南" }, { "id": 30, "name": "浙江" }, { "id": 31, "name": "重庆"}];
var JsonCity = [{ "id": 0, "name": "全国", "pid": 0 }, { "id": 101, "name": "合肥", "pid": 1 }, { "id": 102, "name": "安庆", "pid": 1 }, { "id": 103, "name": "蚌埠", "pid": 1 }, { "id": 104, "name": "巢湖", "pid": 1 }, { "id": 105, "name": "池州", "pid": 1 }, { "id": 106, "name": "阜阳", "pid": 1 }, { "id": 107, "name": "淮北", "pid": 1 }, { "id": 108, "name": "淮南", "pid": 1 }, { "id": 109, "name": "六安", "pid": 1 }, { "id": 110, "name": "马鞍山", "pid": 1 }, { "id": 111, "name": "蒙城", "pid": 1 }, { "id": 112, "name": "宁国", "pid": 1 }, { "id": 113, "name": "铜陵", "pid": 1 }, { "id": 114, "name": "芜湖", "pid": 1 }, { "id": 115, "name": "宣城", "pid": 1 }, { "id": 116, "name": "滁州", "pid": 1 }, { "id": 117, "name": "毫州", "pid": 1 }, { "id": 118, "name": "黄山", "pid": 1 }, { "id": 119, "name": "泗县", "pid": 1 }, { "id": 120, "name": "宿州", "pid": 1 }, { "id": 121, "name": "桐城", "pid": 1 }, { "id": 201, "name": "北京", "pid": 2 }, { "id": 301, "name": "福州", "pid": 3 }, { "id": 302, "name": "厦门", "pid": 3 }, { "id": 303, "name": "龙岩", "pid": 3 }, { "id": 304, "name": "晋江", "pid": 3 }, { "id": 305, "name": "漳州", "pid": 3 }, { "id": 306, "name": "莆田", "pid": 3 }, { "id": 307, "name": "泉州", "pid": 3 }, { "id": 308, "name": "邵武", "pid": 3 }, { "id": 309, "name": "武夷山", "pid": 3 }, { "id": 310, "name": "沙县", "pid": 3 }, { "id": 311, "name": "永安", "pid": 3 }, { "id": 312, "name": "建瓯", "pid": 3 }, { "id": 313, "name": "南安", "pid": 3 }, { "id": 314, "name": "南平", "pid": 3 }, { "id": 315, "name": "宁德", "pid": 3 }, { "id": 316, "name": "浦城", "pid": 3 }, { "id": 317, "name": "福清", "pid": 3 }, { "id": 318, "name": "三明", "pid": 3 }, { "id": 401, "name": "兰州", "pid": 4 }, { "id": 402, "name": "定西", "pid": 4 }, { "id": 404, "name": "合作", "pid": 4 }, { "id": 405, "name": "平凉", "pid": 4 }, { "id": 406, "name": "凉州", "pid": 4 }, { "id": 407, "name": "临夏", "pid": 4 }, { "id": 408, "name": "静宁", "pid": 4 }, { "id": 409, "name": "酒泉", "pid": 4 }, { "id": 410, "name": "张掖", "pid": 4 }, { "id": 411, "name": "庆阳", "pid": 4 }, { "id": 412, "name": "武威", "pid": 4 }, { "id": 413, "name": "武都", "pid": 4 }, { "id": 414, "name": "西峰", "pid": 4 }, { "id": 415, "name": "天水", "pid": 4 }, { "id": 501, "name": "广州", "pid": 5 }, { "id": 502, "name": "深圳", "pid": 5 }, { "id": 503, "name": "珠海", "pid": 5 }, { "id": 504, "name": "东莞", "pid": 5 }, { "id": 505, "name": "中山", "pid": 5 }, { "id": 507, "name": "汕头", "pid": 5 }, { "id": 509, "name": "端州", "pid": 5 }, { "id": 510, "name": "潮州", "pid": 5 }, { "id": 511, "name": "韶关", "pid": 5 }, { "id": 513, "name": "湛江", "pid": 5 }, { "id": 514, "name": "肇庆", "pid": 5 }, { "id": 515, "name": "茂名", "pid": 5 }, { "id": 516, "name": "梅州", "pid": 5 }, { "id": 518, "name": "佛山", "pid": 5 }, { "id": 519, "name": "开平", "pid": 5 }, { "id": 520, "name": "惠州", "pid": 5 }, { "id": 521, "name": "江门", "pid": 5 }, { "id": 522, "name": "揭阳", "pid": 5 }, { "id": 523, "name": "台山", "pid": 5 }, { "id": 524, "name": "清远", "pid": 5 }, { "id": 526, "name": "普宁", "pid": 5 }, { "id": 527, "name": "粤东", "pid": 5 }, { "id": 528, "name": "云浮", "pid": 5 }, { "id": 529, "name": "英德", "pid": 5 }, { "id": 530, "name": "新会", "pid": 5 }, { "id": 531, "name": "阳春", "pid": 5 }, { "id": 532, "name": "阳江", "pid": 5 }, { "id": 533, "name": "揭西", "pid": 5 }, { "id": 534, "name": "流沙", "pid": 5 }, { "id": 535, "name": "河源", "pid": 5 }, { "id": 536, "name": "鹤山", "pid": 5 }, { "id": 537, "name": "高要", "pid": 5 }, { "id": 538, "name": "恩平", "pid": 5 }, { "id": 540, "name": "澄海", "pid": 5 }, { "id": 601, "name": "南宁", "pid": 6 }, { "id": 602, "name": "柳州", "pid": 6 }, { "id": 603, "name": "桂林", "pid": 6 }, { "id": 604, "name": "北海", "pid": 6 }, { "id": 605, "name": "百色", "pid": 6 }, { "id": 606, "name": "贺州", "pid": 6 }, { "id": 607, "name": "河池", "pid": 6 }, { "id": 608, "name": "贵港", "pid": 6 }, { "id": 609, "name": "宜州", "pid": 6 }, { "id": 610, "name": "玉林", "pid": 6 }, { "id": 612, "name": "钦州", "pid": 6 }, { "id": 613, "name": "梧州", "pid": 6 }, { "id": 701, "name": "贵阳", "pid": 7 }, { "id": 702, "name": "遵义", "pid": 7 }, { "id": 703, "name": "兴义", "pid": 7 }, { "id": 705, "name": "安顺", "pid": 7 }, { "id": 706, "name": "毕节", "pid": 7 }, { "id": 707, "name": "都匀", "pid": 7 }, { "id": 708, "name": "六盘水", "pid": 7 }, { "id": 709, "name": "凯里", "pid": 7 }, { "id": 710, "name": "铜仁", "pid": 7 }, { "id": 801, "name": "海口", "pid": 8 }, { "id": 802, "name": "琼海", "pid": 8 }, { "id": 803, "name": "三亚", "pid": 8 }, { "id": 901, "name": "石家庄", "pid": 9 }, { "id": 902, "name": "唐山", "pid": 9 }, { "id": 903, "name": "邢台", "pid": 9 }, { "id": 904, "name": "任丘", "pid": 9 }, { "id": 905, "name": "秦皇岛", "pid": 9 }, { "id": 906, "name": "廊坊", "pid": 9 }, { "id": 907, "name": "邯郸", "pid": 9 }, { "id": 908, "name": "衡水", "pid": 9 }, { "id": 909, "name": "沧州", "pid": 9 }, { "id": 910, "name": "保定", "pid": 9 }, { "id": 911, "name": "张家口", "pid": 9 }, { "id": 912, "name": "承德", "pid": 9 }, { "id": 913, "name": "迁安", "pid": 9 }, { "id": 914, "name": "辛集", "pid": 9 }, { "id": 915, "name": "玉田", "pid": 9 }, { "id": 916, "name": "永清", "pid": 9 }, { "id": 917, "name": "涿州", "pid": 9 }, { "id": 918, "name": "遵化", "pid": 9 }, { "id": 919, "name": "大厂", "pid": 9 }, { "id": 920, "name": "乐亭", "pid": 9 }, { "id": 1001, "name": "郑州", "pid": 10 }, { "id": 1002, "name": "洛阳", "pid": 10 }, { "id": 1003, "name": "周口", "pid": 10 }, { "id": 1004, "name": "信阳", "pid": 10 }, { "id": 1005, "name": "新乡", "pid": 10 }, { "id": 1006, "name": "商丘", "pid": 10 }, { "id": 1007, "name": "三门峡", "pid": 10 }, { "id": 1008, "name": "濮阳", "pid": 10 }, { "id": 1009, "name": "南阳", "pid": 10 }, { "id": 1010, "name": "漯河", "pid": 10 }, { "id": 1011, "name": "焦作", "pid": 10 }, { "id": 1012, "name": "揭东", "pid": 5 }, { "id": 1013, "name": "开封", "pid": 10 }, { "id": 1014, "name": "安阳", "pid": 10 }, { "id": 1015, "name": "德州", "pid": 21 }, { "id": 1016, "name": "鹤壁", "pid": 10 }, { "id": 1017, "name": "林州", "pid": 10 }, { "id": 1018, "name": "平顶山", "pid": 10 }, { "id": 1019, "name": "济源", "pid": 10 }, { "id": 1021, "name": "驻马店", "pid": 10 }, { "id": 1023, "name": "许昌", "pid": 10 }, { "id": 1024, "name": "僕阳", "pid": 10 }, { "id": 1101, "name": "哈尔滨", "pid": 11 }, { "id": 1102, "name": "大庆", "pid": 11 }, { "id": 1103, "name": "齐齐哈尔", "pid": 11 }, { "id": 1104, "name": "鹤岗", "pid": 11 }, { "id": 1105, "name": "北安", "pid": 11 }, { "id": 1106, "name": "佳木斯", "pid": 11 }, { "id": 1107, "name": "鸡西", "pid": 11 }, { "id": 1108, "name": "牡丹江", "pid": 11 }, { "id": 1109, "name": "七台河", "pid": 11 }, { "id": 1110, "name": "齐市", "pid": 11 }, { "id": 1111, "name": "铁力", "pid": 11 }, { "id": 1112, "name": "伊春", "pid": 11 }, { "id": 1113, "name": "黑河", "pid": 11 }, { "id": 1114, "name": "嫩江", "pid": 11 }, { "id": 1115, "name": "南岗", "pid": 11 }, { "id": 1116, "name": "绥化", "pid": 11 }, { "id": 1117, "name": "尚志", "pid": 11 }, { "id": 1118, "name": "双鸭山", "pid": 11 }, { "id": 1119, "name": "绥芬河", "pid": 11 }, { "id": 1120, "name": "加格达奇", "pid": 11 }, { "id": 1201, "name": "武汉", "pid": 12 }, { "id": 1202, "name": "十堰", "pid": 12 }, { "id": 1203, "name": "襄樊", "pid": 12 }, { "id": 1204, "name": "随州", "pid": 12 }, { "id": 1205, "name": "仙桃", "pid": 12 }, { "id": 1206, "name": "天门", "pid": 12 }, { "id": 1207, "name": "宜昌", "pid": 12 }, { "id": 1208, "name": "黄石", "pid": 12 }, { "id": 1209, "name": "荆门", "pid": 12 }, { "id": 1210, "name": "荆州", "pid": 12 }, { "id": 1211, "name": "丹江口", "pid": 12 }, { "id": 1212, "name": "利川", "pid": 12 }, { "id": 1214, "name": "黄冈", "pid": 12 }, { "id": 1215, "name": "恩施", "pid": 12 }, { "id": 1216, "name": "鄂州", "pid": 12 }, { "id": 1217, "name": "咸宁", "pid": 12 }, { "id": 1218, "name": "孝感", "pid": 12 }, { "id": 1219, "name": "潜江", "pid": 12 }, { "id": 1301, "name": "长沙", "pid": 13 }, { "id": 1302, "name": "郴州", "pid": 13 }, { "id": 1303, "name": "常德", "pid": 13 }, { "id": 1304, "name": "衡阳", "pid": 13 }, { "id": 1305, "name": "怀化", "pid": 13 }, { "id": 1306, "name": "娄底", "pid": 13 }, { "id": 1307, "name": "株洲", "pid": 13 }, { "id": 1308, "name": "岳阳", "pid": 13 }, { "id": 1309, "name": "湘潭", "pid": 13 }, { "id": 1310, "name": "邵阳", "pid": 13 }, { "id": 1311, "name": "湘谭", "pid": 13 }, { "id": 1312, "name": "永州", "pid": 13 }, { "id": 1313, "name": "益阳", "pid": 13 }, { "id": 1314, "name": "株州", "pid": 13 }, { "id": 1315, "name": "张家界", "pid": 13 }, { "id": 1316, "name": "吉首", "pid": 13 }, { "id": 1317, "name": "马王堆", "pid": 13 }, { "id": 1318, "name": "浏阳", "pid": 13 }, { "id": 1401, "name": "长春", "pid": 14 }, { "id": 1402, "name": "吉林", "pid": 14 }, { "id": 1403, "name": "通化", "pid": 14 }, { "id": 1404, "name": "延吉", "pid": 14 }, { "id": 1405, "name": "辽源", "pid": 14 }, { "id": 1406, "name": "白山", "pid": 14 }, { "id": 1407, "name": "长岭", "pid": 14 }, { "id": 1408, "name": "梅河口", "pid": 14 }, { "id": 1409, "name": "靖宇", "pid": 14 }, { "id": 1410, "name": "扶余", "pid": 14 }, { "id": 1411, "name": "海城", "pid": 17 }, { "id": 1412, "name": "白城", "pid": 14 }, { "id": 1413, "name": "双辽", "pid": 14 }, { "id": 1414, "name": "顺达", "pid": 14 }, { "id": 1415, "name": "松源", "pid": 14 }, { "id": 1501, "name": "南京", "pid": 15 }, { "id": 1502, "name": "苏州", "pid": 15 }, { "id": 1503, "name": "无锡", "pid": 15 }, { "id": 1504, "name": "常熟", "pid": 15 }, { "id": 1505, "name": "常州", "pid": 15 }, { "id": 1506, "name": "丹阳", "pid": 15 }, { "id": 1507, "name": "淮安", "pid": 15 }, { "id": 1508, "name": "江阴", "pid": 15 }, { "id": 1509, "name": "昆山", "pid": 15 }, { "id": 1510, "name": "连云港", "pid": 15 }, { "id": 1511, "name": "南通", "pid": 15 }, { "id": 1512, "name": "盐城", "pid": 15 }, { "id": 1513, "name": "扬州", "pid": 15 }, { "id": 1514, "name": "张家港", "pid": 15 }, { "id": 1515, "name": "镇江", "pid": 15 }, { "id": 1516, "name": "泰兴", "pid": 15 }, { "id": 1517, "name": "泰州", "pid": 15 }, { "id": 1518, "name": "徐州", "pid": 15 }, { "id": 1519, "name": "吴江", "pid": 15 }, { "id": 1520, "name": "宿迁", "pid": 15 }, { "id": 1521, "name": "太仓", "pid": 15 }, { "id": 1522, "name": "仪征", "pid": 15 }, { "id": 1523, "name": "宜兴", "pid": 15 }, { "id": 1524, "name": "海安", "pid": 15 }, { "id": 1525, "name": "靖江", "pid": 15 }, { "id": 1526, "name": "江宁", "pid": 15 }, { "id": 1527, "name": "淮阴", "pid": 15 }, { "id": 1528, "name": "江都", "pid": 15 }, { "id": 1529, "name": "常锡", "pid": 15 }, { "id": 1601, "name": "南昌", "pid": 16 }, { "id": 1602, "name": "上饶", "pid": 16 }, { "id": 1603, "name": "萍乡", "pid": 16 }, { "id": 1604, "name": "新余", "pid": 16 }, { "id": 1605, "name": "宜春", "pid": 16 }, { "id": 1606, "name": "九江", "pid": 16 }, { "id": 1607, "name": "赣州", "pid": 16 }, { "id": 1608, "name": "赣洲", "pid": 16 }, { "id": 1609, "name": "吉安", "pid": 16 }, { "id": 1611, "name": "津昌", "pid": 16 }, { "id": 1612, "name": "景德镇", "pid": 16 }, { "id": 1613, "name": "抚州", "pid": 16 }, { "id": 1614, "name": "赣南", "pid": 16 }, { "id": 1615, "name": "鹰潭", "pid": 16 }, { "id": 1616, "name": "四平", "pid": 14 }, { "id": 1701, "name": "沈阳", "pid": 17 }, { "id": 1702, "name": "丹东", "pid": 17 }, { "id": 1703, "name": "抚顺", "pid": 17 }, { "id": 1704, "name": "阜新", "pid": 17 }, { "id": 1705, "name": "葫芦岛", "pid": 17 }, { "id": 1706, "name": "大石桥", "pid": 17 }, { "id": 1707, "name": "朝阳", "pid": 17 }, { "id": 1708, "name": "大连", "pid": 17 }, { "id": 1709, "name": "本溪", "pid": 17 }, { "id": 1710, "name": "鞍山", "pid": 17 }, { "id": 1711, "name": "锦州", "pid": 17 }, { "id": 1712, "name": "辽河", "pid": 17 }, { "id": 1713, "name": "辽阳", "pid": 17 }, { "id": 1714, "name": "营口", "pid": 17 }, { "id": 1715, "name": "瓦房店", "pid": 17 }, { "id": 1716, "name": "盘锦", "pid": 17 }, { "id": 1717, "name": "铁岭", "pid": 17 }, { "id": 1718, "name": "兴隆", "pid": 9 }, { "id": 1801, "name": "呼和浩特", "pid": 18 }, { "id": 1802, "name": "包头", "pid": 18 }, { "id": 1803, "name": "赤峰", "pid": 18 }, { "id": 1804, "name": "通辽", "pid": 18 }, { "id": 1805, "name": "乌海", "pid": 18 }, { "id": 1806, "name": "东胜", "pid": 18 }, { "id": 1807, "name": "海拉尔", "pid": 18 }, { "id": 1808, "name": "鄂尔多斯", "pid": 18 }, { "id": 1809, "name": "临河", "pid": 18 }, { "id": 1810, "name": "呼市", "pid": 18 }, { "id": 1811, "name": "集宁", "pid": 18 }, { "id": 1812, "name": "呼伦贝尔", "pid": 18 }, { "id": 1813, "name": "巴盟", "pid": 18 }, { "id": 1814, "name": "兴安盟", "pid": 18 }, { "id": 1815, "name": "牙克石", "pid": 18 }, { "id": 1816, "name": "乌兰浩特", "pid": 18 }, { "id": 1817, "name": "锡盟", "pid": 18 }, { "id": 1818, "name": "锡林浩特", "pid": 18 }, { "id": 1901, "name": "银川", "pid": 19 }, { "id": 1902, "name": "吴忠", "pid": 19 }, { "id": 1903, "name": "固原", "pid": 19 }, { "id": 1904, "name": "石嘴山", "pid": 19 }, { "id": 2001, "name": "西宁", "pid": 20 }, { "id": 2002, "name": "格尔木", "pid": 20 }, { "id": 2003, "name": "青海", "pid": 20 }, { "id": 2022, "name": "新郑", "pid": 10 }, { "id": 2101, "name": "济南", "pid": 21 }, { "id": 2102, "name": "青岛", "pid": 21 }, { "id": 2103, "name": "烟台", "pid": 21 }, { "id": 2104, "name": "威海", "pid": 21 }, { "id": 2105, "name": "潍坊", "pid": 21 }, { "id": 2106, "name": "泰安", "pid": 21 }, { "id": 2107, "name": "枣庄", "pid": 21 }, { "id": 2108, "name": "招远", "pid": 21 }, { "id": 2109, "name": "淄博", "pid": 21 }, { "id": 2110, "name": "东营", "pid": 21 }, { "id": 2111, "name": "高密", "pid": 21 }, { "id": 2112, "name": "菏泽", "pid": 21 }, { "id": 2113, "name": "滨州", "pid": 21 }, { "id": 2114, "name": "聊城", "pid": 21 }, { "id": 2115, "name": "龙口", "pid": 21 }, { "id": 2116, "name": "莱州", "pid": 21 }, { "id": 2117, "name": "临沂", "pid": 21 }, { "id": 2118, "name": "济宁", "pid": 21 }, { "id": 2119, "name": "青州", "pid": 21 }, { "id": 2120, "name": "日照", "pid": 21 }, { "id": 2121, "name": "荣成", "pid": 21 }, { "id": 2122, "name": "邵东", "pid": 13 }, { "id": 2123, "name": "寿光", "pid": 21 }, { "id": 2124, "name": "文登", "pid": 21 }, { "id": 2125, "name": "滕州", "pid": 21 }, { "id": 2126, "name": "烟威", "pid": 21 }, { "id": 2127, "name": "沂水", "pid": 21 }, { "id": 2128, "name": "荷泽", "pid": 21 }, { "id": 2129, "name": "平度", "pid": 21 }, { "id": 2130, "name": "即墨", "pid": 21 }, { "id": 2131, "name": "胶南", "pid": 21 }, { "id": 2132, "name": "莱芜", "pid": 21 }, { "id": 2133, "name": "莱西", "pid": 21 }, { "id": 2134, "name": "莱阳", "pid": 21 }, { "id": 2201, "name": "太原", "pid": 22 }, { "id": 2202, "name": "大同", "pid": 22 }, { "id": 2203, "name": "晋城", "pid": 22 }, { "id": 2204, "name": "晋中", "pid": 22 }, { "id": 2205, "name": "临汾", "pid": 22 }, { "id": 2206, "name": "长治", "pid": 22 }, { "id": 2207, "name": "运城", "pid": 22 }, { "id": 2208, "name": "榆次", "pid": 22 }, { "id": 2209, "name": "孝义", "pid": 22 }, { "id": 2210, "name": "忻州", "pid": 22 }, { "id": 2211, "name": "介休", "pid": 22 }, { "id": 2212, "name": "离石", "pid": 22 }, { "id": 2213, "name": "候马", "pid": 22 }, { "id": 2214, "name": "洪洞", "pid": 22 }, { "id": 2215, "name": "侯马", "pid": 22 }, { "id": 2216, "name": "合津", "pid": 22 }, { "id": 2217, "name": "汾阳", "pid": 22 }, { "id": 2218, "name": "阳泉", "pid": 22 }, { "id": 2219, "name": "朔州", "pid": 22 }, { "id": 2220, "name": "吕梁", "pid": 22 }, { "id": 2301, "name": "西安", "pid": 23 }, { "id": 2302, "name": "咸阳", "pid": 23 }, { "id": 2303, "name": "渭南", "pid": 23 }, { "id": 2304, "name": "榆林", "pid": 23 }, { "id": 2305, "name": "宝鸡", "pid": 23 }, { "id": 2306, "name": "安康", "pid": 23 }, { "id": 2307, "name": "汉中", "pid": 23 }, { "id": 2308, "name": "延安", "pid": 23 }, { "id": 2309, "name": "韩城", "pid": 23 }, { "id": 2310, "name": "铜川", "pid": 23 }, { "id": 2311, "name": "商洛", "pid": 23 }, { "id": 2401, "name": "上海", "pid": 24 }, { "id": 2501, "name": "成都", "pid": 25 }, { "id": 2502, "name": "绵阳", "pid": 25 }, { "id": 2503, "name": "遂宁", "pid": 25 }, { "id": 2504, "name": "攀枝花", "pid": 25 }, { "id": 2505, "name": "西昌", "pid": 25 }, { "id": 2506, "name": "宜宾", "pid": 25 }, { "id": 2507, "name": "雅安", "pid": 25 }, { "id": 2508, "name": "自贡", "pid": 25 }, { "id": 2509, "name": "资阳", "pid": 25 }, { "id": 2510, "name": "广元", "pid": 25 }, { "id": 2511, "name": "德阳", "pid": 25 }, { "id": 2512, "name": "乐山", "pid": 25 }, { "id": 2513, "name": "南充", "pid": 25 }, { "id": 2514, "name": "眉山", "pid": 25 }, { "id": 2515, "name": "峨眉山", "pid": 25 }, { "id": 2516, "name": "巴中", "pid": 25 }, { "id": 2517, "name": "泸州", "pid": 25 }, { "id": 2518, "name": "绵竹", "pid": 25 }, { "id": 2519, "name": "内江", "pid": 25 }, { "id": 2520, "name": "荣县", "pid": 25 }, { "id": 2521, "name": "武候", "pid": 25 }, { "id": 2522, "name": "达州", "pid": 25 }, { "id": 2523, "name": "广安", "pid": 25 }, { "id": 2524, "name": "凉山", "pid": 25 }, { "id": 2525, "name": "甘孜", "pid": 25 }, { "id": 2526, "name": "阿坝", "pid": 25 }, { "id": 2601, "name": "天津", "pid": 26 }, { "id": 2701, "name": "拉萨", "pid": 27 }, { "id": 2703, "name": "日喀则", "pid": 27 }, { "id": 2704, "name": "山南", "pid": 27 }, { "id": 2801, "name": "乌鲁木齐", "pid": 28 }, { "id": 2802, "name": "喀什", "pid": 28 }, { "id": 2803, "name": "克拉玛依", "pid": 28 }, { "id": 2804, "name": "库尔勒", "pid": 28 }, { "id": 2805, "name": "奎屯", "pid": 28 }, { "id": 2806, "name": "哈密", "pid": 28 }, { "id": 2807, "name": "吐鲁番", "pid": 28 }, { "id": 2808, "name": "伊宁", "pid": 28 }, { "id": 2809, "name": "博乐", "pid": 28 }, { "id": 2810, "name": "石河子", "pid": 28 }, { "id": 2811, "name": "乌市", "pid": 28 }, { "id": 2812, "name": "塔城", "pid": 28 }, { "id": 2813, "name": "昌吉", "pid": 28 }, { "id": 2814, "name": "巴州库尔勒", "pid": 28 }, { "id": 2815, "name": "阿勒泰", "pid": 28 }, { "id": 2816, "name": "阿图什", "pid": 28 }, { "id": 2817, "name": "阿克苏", "pid": 28 }, { "id": 2818, "name": "和田", "pid": 28 }, { "id": 2901, "name": "昆明", "pid": 29 }, { "id": 2902, "name": "玉溪", "pid": 29 }, { "id": 2903, "name": "曲靖", "pid": 29 }, { "id": 2904, "name": "大理", "pid": 29 }, { "id": 2905, "name": "开远", "pid": 29 }, { "id": 2907, "name": "保山", "pid": 29 }, { "id": 2908, "name": "楚雄", "pid": 29 }, { "id": 2909, "name": "个旧", "pid": 29 }, { "id": 2910, "name": "潞西", "pid": 29 }, { "id": 2911, "name": "临沧", "pid": 29 }, { "id": 2912, "name": "金山", "pid": 24 }, { "id": 2913, "name": "健中冈", "pid": 29 }, { "id": 2914, "name": "文山", "pid": 29 }, { "id": 2915, "name": "西双版纳", "pid": 29 }, { "id": 2916, "name": "思茅", "pid": 29 }, { "id": 2918, "name": "昭通", "pid": 29 }, { "id": 2919, "name": "州芒", "pid": 29 }, { "id": 3001, "name": "杭州", "pid": 30 }, { "id": 3002, "name": "宁波", "pid": 30 }, { "id": 3003, "name": "温州", "pid": 30 }, { "id": 3004, "name": "黄岩", "pid": 30 }, { "id": 3005, "name": "嘉兴", "pid": 30 }, { "id": 3006, "name": "金华", "pid": 30 }, { "id": 3008, "name": "乐清", "pid": 30 }, { "id": 3009, "name": "丽水", "pid": 30 }, { "id": 3010, "name": "东阳", "pid": 30 }, { "id": 3011, "name": "湖州", "pid": 30 }, { "id": 3012, "name": "衢州", "pid": 30 }, { "id": 3013, "name": "瑞安", "pid": 30 }, { "id": 3014, "name": "平阳", "pid": 30 }, { "id": 3015, "name": "台州", "pid": 30 }, { "id": 3016, "name": "绍兴", "pid": 30 }, { "id": 3017, "name": "萧山", "pid": 30 }, { "id": 3018, "name": "永康", "pid": 30 }, { "id": 3019, "name": "义乌", "pid": 30 }, { "id": 3020, "name": "舟山", "pid": 30 }, { "id": 3021, "name": "长兴", "pid": 30 }, { "id": 3022, "name": "诸暨", "pid": 30 }, { "id": 3023, "name": "诸市", "pid": 30 }, { "id": 3025, "name": "玉环", "pid": 30 }, { "id": 3026, "name": "余杭", "pid": 30 }, { "id": 3027, "name": "余姚", "pid": 30 }, { "id": 3028, "name": "永嘉", "pid": 30 }, { "id": 3029, "name": "嵊州", "pid": 30 }, { "id": 3030, "name": "上虞", "pid": 30 }, { "id": 3031, "name": "温岭", "pid": 30 }, { "id": 3032, "name": "桐庐", "pid": 30 }, { "id": 3033, "name": "天台", "pid": 30 }, { "id": 3034, "name": "建德", "pid": 30 }, { "id": 3035, "name": "浒山", "pid": 30 }, { "id": 3036, "name": "康桥", "pid": 30 }, { "id": 3037, "name": "临安", "pid": 30 }, { "id": 3038, "name": "龙游", "pid": 30 }, { "id": 3039, "name": "临海", "pid": 30 }, { "id": 3040, "name": "德清", "pid": 30 }, { "id": 3041, "name": "富阳", "pid": 30 }, { "id": 3042, "name": "仓南", "pid": 30 }, { "id": 3043, "name": "安吉", "pid": 30 }, { "id": 3044, "name": "慈溪", "pid": 30 }, { "id": 3101, "name": "重庆", "pid": 31 }, { "id": 3102, "name": "永川", "pid": 31 }, { "id": 3103, "name": "奉节", "pid": 31 }, { "id": 3104, "name": "涪陵", "pid": 31 }, { "id": 3105, "name": "江津", "pid": 31 } ]
//var JsonCity = [{ "id": 0, "name": "全国" }, { "id": 101, "name": "合肥" }, { "id": 102, "name": "安庆" }, { "id": 103, "name": "蚌埠" }, { "id": 104, "name": "巢湖" }, { "id": 105, "name": "池州" }, { "id": 106, "name": "阜阳" }, { "id": 107, "name": "淮北" }, { "id": 108, "name": "淮南" }, { "id": 109, "name": "六安" }, { "id": 110, "name": "马鞍山" }, { "id": 111, "name": "蒙城" }, { "id": 112, "name": "宁国" }, { "id": 113, "name": "铜陵" }, { "id": 114, "name": "芜湖" }, { "id": 115, "name": "宣城" }, { "id": 116, "name": "滁州" }, { "id": 117, "name": "毫州" }, { "id": 118, "name": "黄山" }, { "id": 119, "name": "泗县" }, { "id": 120, "name": "宿州" }, { "id": 121, "name": "桐城" }, { "id": 201, "name": "北京" }, { "id": 301, "name": "福州" }, { "id": 302, "name": "厦门" }, { "id": 303, "name": "龙岩" }, { "id": 304, "name": "晋江" }, { "id": 305, "name": "漳州" }, { "id": 306, "name": "莆田" }, { "id": 307, "name": "泉州" }, { "id": 308, "name": "邵武" }, { "id": 309, "name": "武夷山" }, { "id": 310, "name": "沙县" }, { "id": 311, "name": "永安" }, { "id": 312, "name": "建瓯" }, { "id": 313, "name": "南安" }, { "id": 314, "name": "南平" }, { "id": 315, "name": "宁德" }, { "id": 316, "name": "浦城" }, { "id": 317, "name": "福清" }, { "id": 318, "name": "三明" }, { "id": 401, "name": "兰州" }, { "id": 402, "name": "定西" }, { "id": 404, "name": "合作" }, { "id": 405, "name": "平凉" }, { "id": 406, "name": "凉州" }, { "id": 407, "name": "临夏" }, { "id": 408, "name": "静宁" }, { "id": 409, "name": "酒泉" }, { "id": 410, "name": "张掖" }, { "id": 411, "name": "庆阳" }, { "id": 412, "name": "武威" }, { "id": 413, "name": "武都" }, { "id": 414, "name": "西峰" }, { "id": 415, "name": "天水" }, { "id": 501, "name": "广州" }, { "id": 502, "name": "深圳" }, { "id": 503, "name": "珠海" }, { "id": 504, "name": "东莞" }, { "id": 505, "name": "中山" }, { "id": 507, "name": "汕头" }, { "id": 509, "name": "端州" }, { "id": 510, "name": "潮州" }, { "id": 511, "name": "韶关" }, { "id": 513, "name": "湛江" }, { "id": 514, "name": "肇庆" }, { "id": 515, "name": "茂名" }, { "id": 516, "name": "梅州" }, { "id": 518, "name": "佛山" }, { "id": 519, "name": "开平" }, { "id": 520, "name": "惠州" }, { "id": 521, "name": "江门" }, { "id": 522, "name": "揭阳" }, { "id": 523, "name": "台山" }, { "id": 524, "name": "清远" }, { "id": 526, "name": "普宁" }, { "id": 527, "name": "粤东" }, { "id": 528, "name": "云浮" }, { "id": 529, "name": "英德" }, { "id": 530, "name": "新会" }, { "id": 531, "name": "阳春" }, { "id": 532, "name": "阳江" }, { "id": 533, "name": "揭西" }, { "id": 534, "name": "流沙" }, { "id": 535, "name": "河源" }, { "id": 536, "name": "鹤山" }, { "id": 537, "name": "高要" }, { "id": 538, "name": "恩平" }, { "id": 540, "name": "澄海" }, { "id": 601, "name": "南宁" }, { "id": 602, "name": "柳州" }, { "id": 603, "name": "桂林" }, { "id": 604, "name": "北海" }, { "id": 605, "name": "百色" }, { "id": 606, "name": "贺州" }, { "id": 607, "name": "河池" }, { "id": 608, "name": "贵港" }, { "id": 609, "name": "宜州" }, { "id": 610, "name": "玉林" }, { "id": 612, "name": "钦州" }, { "id": 613, "name": "梧州" }, { "id": 701, "name": "贵阳" }, { "id": 702, "name": "遵义" }, { "id": 703, "name": "兴义" }, { "id": 705, "name": "安顺" }, { "id": 706, "name": "毕节" }, { "id": 707, "name": "都匀" }, { "id": 708, "name": "六盘水" }, { "id": 709, "name": "凯里" }, { "id": 710, "name": "铜仁" }, { "id": 801, "name": "海口" }, { "id": 802, "name": "琼海" }, { "id": 803, "name": "三亚" }, { "id": 901, "name": "石家庄" }, { "id": 902, "name": "唐山" }, { "id": 903, "name": "邢台" }, { "id": 904, "name": "任丘" }, { "id": 905, "name": "秦皇岛" }, { "id": 906, "name": "廊坊" }, { "id": 907, "name": "邯郸" }, { "id": 908, "name": "衡水" }, { "id": 909, "name": "沧州" }, { "id": 910, "name": "保定" }, { "id": 911, "name": "张家口" }, { "id": 912, "name": "承德" }, { "id": 913, "name": "迁安" }, { "id": 914, "name": "辛集" }, { "id": 915, "name": "玉田" }, { "id": 916, "name": "永清" }, { "id": 917, "name": "涿州" }, { "id": 918, "name": "遵化" }, { "id": 919, "name": "大厂" }, { "id": 920, "name": "乐亭" }, { "id": 1001, "name": "郑州" }, { "id": 1002, "name": "洛阳" }, { "id": 1003, "name": "周口" }, { "id": 1004, "name": "信阳" }, { "id": 1005, "name": "新乡" }, { "id": 1006, "name": "商丘" }, { "id": 1007, "name": "三门峡" }, { "id": 1008, "name": "濮阳" }, { "id": 1009, "name": "南阳" }, { "id": 1010, "name": "漯河" }, { "id": 1011, "name": "焦作" }, { "id": 1012, "name": "揭东" }, { "id": 1013, "name": "开封" }, { "id": 1014, "name": "安阳" }, { "id": 1015, "name": "德州" }, { "id": 1016, "name": "鹤壁" }, { "id": 1017, "name": "林州" }, { "id": 1018, "name": "平顶山" }, { "id": 1019, "name": "济源" }, { "id": 1021, "name": "驻马店" }, { "id": 1023, "name": "许昌" }, { "id": 1024, "name": "僕阳" }, { "id": 1101, "name": "哈尔滨" }, { "id": 1102, "name": "大庆" }, { "id": 1103, "name": "齐齐哈尔" }, { "id": 1104, "name": "鹤岗" }, { "id": 1105, "name": "北安" }, { "id": 1106, "name": "佳木斯" }, { "id": 1107, "name": "鸡西" }, { "id": 1108, "name": "牡丹江" }, { "id": 1109, "name": "七台河" }, { "id": 1110, "name": "齐市" }, { "id": 1111, "name": "铁力" }, { "id": 1112, "name": "伊春" }, { "id": 1113, "name": "黑河" }, { "id": 1114, "name": "嫩江" }, { "id": 1115, "name": "南岗" }, { "id": 1116, "name": "绥化" }, { "id": 1117, "name": "尚志" }, { "id": 1118, "name": "双鸭山" }, { "id": 1119, "name": "绥芬河" }, { "id": 1120, "name": "加格达奇" }, { "id": 1201, "name": "武汉" }, { "id": 1202, "name": "十堰" }, { "id": 1203, "name": "襄樊" }, { "id": 1204, "name": "随州" }, { "id": 1205, "name": "仙桃" }, { "id": 1206, "name": "天门" }, { "id": 1207, "name": "宜昌" }, { "id": 1208, "name": "黄石" }, { "id": 1209, "name": "荆门" }, { "id": 1210, "name": "荆州" }, { "id": 1211, "name": "丹江口" }, { "id": 1212, "name": "利川" }, { "id": 1214, "name": "黄冈" }, { "id": 1215, "name": "恩施" }, { "id": 1216, "name": "鄂州" }, { "id": 1217, "name": "咸宁" }, { "id": 1218, "name": "孝感" }, { "id": 1219, "name": "潜江" }, { "id": 1301, "name": "长沙" }, { "id": 1302, "name": "郴州" }, { "id": 1303, "name": "常德" }, { "id": 1304, "name": "衡阳" }, { "id": 1305, "name": "怀化" }, { "id": 1306, "name": "娄底" }, { "id": 1307, "name": "株洲" }, { "id": 1308, "name": "岳阳" }, { "id": 1309, "name": "湘潭" }, { "id": 1310, "name": "邵阳" }, { "id": 1311, "name": "湘谭" }, { "id": 1312, "name": "永州" }, { "id": 1313, "name": "益阳" }, { "id": 1314, "name": "株州" }, { "id": 1315, "name": "张家界" }, { "id": 1316, "name": "吉首" }, { "id": 1317, "name": "马王堆" }, { "id": 1318, "name": "浏阳" }, { "id": 1401, "name": "长春" }, { "id": 1402, "name": "吉林" }, { "id": 1403, "name": "通化" }, { "id": 1404, "name": "延吉" }, { "id": 1405, "name": "辽源" }, { "id": 1406, "name": "白山" }, { "id": 1407, "name": "长岭" }, { "id": 1408, "name": "梅河口" }, { "id": 1409, "name": "靖宇" }, { "id": 1410, "name": "扶余" }, { "id": 1411, "name": "海城" }, { "id": 1412, "name": "白城" }, { "id": 1413, "name": "双辽" }, { "id": 1414, "name": "顺达" }, { "id": 1415, "name": "松源" }, { "id": 1501, "name": "南京" }, { "id": 1502, "name": "苏州" }, { "id": 1503, "name": "无锡" }, { "id": 1504, "name": "常熟" }, { "id": 1505, "name": "常州" }, { "id": 1506, "name": "丹阳" }, { "id": 1507, "name": "淮安" }, { "id": 1508, "name": "江阴" }, { "id": 1509, "name": "昆山" }, { "id": 1510, "name": "连云港" }, { "id": 1511, "name": "南通" }, { "id": 1512, "name": "盐城" }, { "id": 1513, "name": "扬州" }, { "id": 1514, "name": "张家港" }, { "id": 1515, "name": "镇江" }, { "id": 1516, "name": "泰兴" }, { "id": 1517, "name": "泰州" }, { "id": 1518, "name": "徐州" }, { "id": 1519, "name": "吴江" }, { "id": 1520, "name": "宿迁" }, { "id": 1521, "name": "太仓" }, { "id": 1522, "name": "仪征" }, { "id": 1523, "name": "宜兴" }, { "id": 1524, "name": "海安" }, { "id": 1525, "name": "靖江" }, { "id": 1526, "name": "江宁" }, { "id": 1527, "name": "淮阴" }, { "id": 1528, "name": "江都" }, { "id": 1529, "name": "常锡" }, { "id": 1601, "name": "南昌" }, { "id": 1602, "name": "上饶" }, { "id": 1603, "name": "萍乡" }, { "id": 1604, "name": "新余" }, { "id": 1605, "name": "宜春" }, { "id": 1606, "name": "九江" }, { "id": 1607, "name": "赣州" }, { "id": 1608, "name": "赣洲" }, { "id": 1609, "name": "吉安" }, { "id": 1611, "name": "津昌" }, { "id": 1612, "name": "景德镇" }, { "id": 1613, "name": "抚州" }, { "id": 1614, "name": "赣南" }, { "id": 1615, "name": "鹰潭" }, { "id": 1616, "name": "四平" }, { "id": 1701, "name": "沈阳" }, { "id": 1702, "name": "丹东" }, { "id": 1703, "name": "抚顺" }, { "id": 1704, "name": "阜新" }, { "id": 1705, "name": "葫芦岛" }, { "id": 1706, "name": "大石桥" }, { "id": 1707, "name": "朝阳" }, { "id": 1708, "name": "大连" }, { "id": 1709, "name": "本溪" }, { "id": 1710, "name": "鞍山" }, { "id": 1711, "name": "锦州" }, { "id": 1712, "name": "辽河" }, { "id": 1713, "name": "辽阳" }, { "id": 1714, "name": "营口" }, { "id": 1715, "name": "瓦房店" }, { "id": 1716, "name": "盘锦" }, { "id": 1717, "name": "铁岭" }, { "id": 1718, "name": "兴隆" }, { "id": 1801, "name": "呼和浩特" }, { "id": 1802, "name": "包头" }, { "id": 1803, "name": "赤峰" }, { "id": 1804, "name": "通辽" }, { "id": 1805, "name": "乌海" }, { "id": 1806, "name": "东胜" }, { "id": 1807, "name": "海拉尔" }, { "id": 1808, "name": "鄂尔多斯" }, { "id": 1809, "name": "临河" }, { "id": 1810, "name": "呼市" }, { "id": 1811, "name": "集宁" }, { "id": 1812, "name": "呼伦贝尔" }, { "id": 1813, "name": "巴盟" }, { "id": 1814, "name": "兴安盟" }, { "id": 1815, "name": "牙克石" }, { "id": 1816, "name": "乌兰浩特" }, { "id": 1817, "name": "锡盟" }, { "id": 1818, "name": "锡林浩特" }, { "id": 1901, "name": "银川" }, { "id": 1902, "name": "吴忠" }, { "id": 1903, "name": "固原" }, { "id": 1904, "name": "石嘴山" }, { "id": 2001, "name": "西宁" }, { "id": 2002, "name": "格尔木" }, { "id": 2003, "name": "青海" }, { "id": 2022, "name": "新郑" }, { "id": 2101, "name": "济南" }, { "id": 2102, "name": "青岛" }, { "id": 2103, "name": "烟台" }, { "id": 2104, "name": "威海" }, { "id": 2105, "name": "潍坊" }, { "id": 2106, "name": "泰安" }, { "id": 2107, "name": "枣庄" }, { "id": 2108, "name": "招远" }, { "id": 2109, "name": "淄博" }, { "id": 2110, "name": "东营" }, { "id": 2111, "name": "高密" }, { "id": 2112, "name": "菏泽" }, { "id": 2113, "name": "滨州" }, { "id": 2114, "name": "聊城" }, { "id": 2115, "name": "龙口" }, { "id": 2116, "name": "莱州" }, { "id": 2117, "name": "临沂" }, { "id": 2118, "name": "济宁" }, { "id": 2119, "name": "青州" }, { "id": 2120, "name": "日照" }, { "id": 2121, "name": "荣成" }, { "id": 2122, "name": "邵东" }, { "id": 2123, "name": "寿光" }, { "id": 2124, "name": "文登" }, { "id": 2125, "name": "滕州" }, { "id": 2126, "name": "烟威" }, { "id": 2127, "name": "沂水" }, { "id": 2128, "name": "荷泽" }, { "id": 2129, "name": "平度" }, { "id": 2130, "name": "即墨" }, { "id": 2131, "name": "胶南" }, { "id": 2132, "name": "莱芜" }, { "id": 2133, "name": "莱西" }, { "id": 2134, "name": "莱阳" }, { "id": 2201, "name": "太原" }, { "id": 2202, "name": "大同" }, { "id": 2203, "name": "晋城" }, { "id": 2204, "name": "晋中" }, { "id": 2205, "name": "临汾" }, { "id": 2206, "name": "长治" }, { "id": 2207, "name": "运城" }, { "id": 2208, "name": "榆次" }, { "id": 2209, "name": "孝义" }, { "id": 2210, "name": "忻州" }, { "id": 2211, "name": "介休" }, { "id": 2212, "name": "离石" }, { "id": 2213, "name": "候马" }, { "id": 2214, "name": "洪洞" }, { "id": 2215, "name": "侯马" }, { "id": 2216, "name": "合津" }, { "id": 2217, "name": "汾阳" }, { "id": 2218, "name": "阳泉" }, { "id": 2219, "name": "朔州" }, { "id": 2220, "name": "吕梁" }, { "id": 2301, "name": "西安" }, { "id": 2302, "name": "咸阳" }, { "id": 2303, "name": "渭南" }, { "id": 2304, "name": "榆林" }, { "id": 2305, "name": "宝鸡" }, { "id": 2306, "name": "安康" }, { "id": 2307, "name": "汉中" }, { "id": 2308, "name": "延安" }, { "id": 2309, "name": "韩城" }, { "id": 2310, "name": "铜川" }, { "id": 2311, "name": "商洛" }, { "id": 2401, "name": "上海" }, { "id": 2501, "name": "成都" }, { "id": 2502, "name": "绵阳" }, { "id": 2503, "name": "遂宁" }, { "id": 2504, "name": "攀枝花" }, { "id": 2505, "name": "西昌" }, { "id": 2506, "name": "宜宾" }, { "id": 2507, "name": "雅安" }, { "id": 2508, "name": "自贡" }, { "id": 2509, "name": "资阳" }, { "id": 2510, "name": "广元" }, { "id": 2511, "name": "德阳" }, { "id": 2512, "name": "乐山" }, { "id": 2513, "name": "南充" }, { "id": 2514, "name": "眉山" }, { "id": 2515, "name": "峨眉山" }, { "id": 2516, "name": "巴中" }, { "id": 2517, "name": "泸州" }, { "id": 2518, "name": "绵竹" }, { "id": 2519, "name": "内江" }, { "id": 2520, "name": "荣县" }, { "id": 2521, "name": "武候" }, { "id": 2522, "name": "达州" }, { "id": 2523, "name": "广安" }, { "id": 2524, "name": "凉山" }, { "id": 2525, "name": "甘孜" }, { "id": 2526, "name": "阿坝" }, { "id": 2601, "name": "天津" }, { "id": 2701, "name": "拉萨" }, { "id": 2703, "name": "日喀则" }, { "id": 2704, "name": "山南" }, { "id": 2801, "name": "乌鲁木齐" }, { "id": 2802, "name": "喀什" }, { "id": 2803, "name": "克拉玛依" }, { "id": 2804, "name": "库尔勒" }, { "id": 2805, "name": "奎屯" }, { "id": 2806, "name": "哈密" }, { "id": 2807, "name": "吐鲁番" }, { "id": 2808, "name": "伊宁" }, { "id": 2809, "name": "博乐" }, { "id": 2810, "name": "石河子" }, { "id": 2811, "name": "乌市" }, { "id": 2812, "name": "塔城" }, { "id": 2813, "name": "昌吉" }, { "id": 2814, "name": "巴州库尔勒" }, { "id": 2815, "name": "阿勒泰" }, { "id": 2816, "name": "阿图什" }, { "id": 2817, "name": "阿克苏" }, { "id": 2818, "name": "和田" }, { "id": 2901, "name": "昆明" }, { "id": 2902, "name": "玉溪" }, { "id": 2903, "name": "曲靖" }, { "id": 2904, "name": "大理" }, { "id": 2905, "name": "开远" }, { "id": 2907, "name": "保山" }, { "id": 2908, "name": "楚雄" }, { "id": 2909, "name": "个旧" }, { "id": 2910, "name": "潞西" }, { "id": 2911, "name": "临沧" }, { "id": 2912, "name": "金山" }, { "id": 2913, "name": "健中冈" }, { "id": 2914, "name": "文山" }, { "id": 2915, "name": "西双版纳" }, { "id": 2916, "name": "思茅" }, { "id": 2918, "name": "昭通" }, { "id": 2919, "name": "州芒" }, { "id": 3001, "name": "杭州" }, { "id": 3002, "name": "宁波" }, { "id": 3003, "name": "温州" }, { "id": 3004, "name": "黄岩" }, { "id": 3005, "name": "嘉兴" }, { "id": 3006, "name": "金华" }, { "id": 3008, "name": "乐清" }, { "id": 3009, "name": "丽水" }, { "id": 3010, "name": "东阳" }, { "id": 3011, "name": "湖州" }, { "id": 3012, "name": "衢州" }, { "id": 3013, "name": "瑞安" }, { "id": 3014, "name": "平阳" }, { "id": 3015, "name": "台州" }, { "id": 3016, "name": "绍兴" }, { "id": 3017, "name": "萧山" }, { "id": 3018, "name": "永康" }, { "id": 3019, "name": "义乌" }, { "id": 3020, "name": "舟山" }, { "id": 3021, "name": "长兴" }, { "id": 3022, "name": "诸暨" }, { "id": 3023, "name": "诸市" }, { "id": 3025, "name": "玉环" }, { "id": 3026, "name": "余杭" }, { "id": 3027, "name": "余姚" }, { "id": 3028, "name": "永嘉" }, { "id": 3029, "name": "嵊州" }, { "id": 3030, "name": "上虞" }, { "id": 3031, "name": "温岭" }, { "id": 3032, "name": "桐庐" }, { "id": 3033, "name": "天台" }, { "id": 3034, "name": "建德" }, { "id": 3035, "name": "浒山" }, { "id": 3036, "name": "康桥" }, { "id": 3037, "name": "临安" }, { "id": 3038, "name": "龙游" }, { "id": 3039, "name": "临海" }, { "id": 3040, "name": "德清" }, { "id": 3041, "name": "富阳" }, { "id": 3042, "name": "仓南" }, { "id": 3043, "name": "安吉" }, { "id": 3044, "name": "慈溪" }, { "id": 3101, "name": "重庆" }, { "id": 3102, "name": "永川" }, { "id": 3103, "name": "奉节" }, { "id": 3104, "name": "涪陵" }, { "id": 3105, "name": "江津"}]
var JsonCityArea = [{ "id": 20101, "name": "东城区" }, { "id": 20102, "name": "西城区" }, { "id": 20103, "name": "海淀区" }, { "id": 20104, "name": "朝阳区" }, { "id": 20105, "name": "丰台区" }, { "id": 20106, "name": "石景山区" }, { "id": 20107, "name": "通州区" }, { "id": 20108, "name": "顺义区" }, { "id": 20109, "name": "昌平区" }, { "id": 20110, "name": "大兴区" }, { "id": 20111, "name": "房山区" }, { "id": 20112, "name": "门头沟区" }, { "id": 20113, "name": "平谷区" }, { "id": 20114, "name": "怀柔区" }, { "id": 20115, "name": "密云县" }, { "id": 20116, "name": "延庆县"}];
//车身颜色
var colorarray = ["黑色", "白色", "银色", "灰色", "红色", "橙色", "蓝色", "绿色", "黄色", "紫色", "多彩车身"];
//显示图片列表左右按钮
var outher_smaill_leftbtn_rightbtn = "<span onclick='outherimg_leftbtn_rightbtn_onclick(0)' class='outher_imglist_imgClickLeft'></span><span class='outher_imglist_imgClickRight' onclick='outherimg_leftbtn_rightbtn_onclick(1)'></span>";
var outher_smaill_carinfo_weizhi = [
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/0_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/1_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/2_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/3_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/4_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/5_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/6_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/7_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/8_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/9_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/10_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/11_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/12_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/13_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/14_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/15_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/16_18.png'/></div>",
"<div class='carRecessOut_smaill_carinfo'><img src='local/images/17_18.png'/></div>"
];

var skeletonRightPoint = [
	"map3_7_1",
	"map3_7_2",
	"map3_6_1",
	"map3_6_2",
	"map3_6_3",
	"map3_s_g",
	"map3_1_1",
	"map3_t_g",
	"map3_h_g",
	"map3_h_f",
	"map3_r_g",
	"map3_n_g",
	"map3_n_h",
	"map3_r_e",
	"map3_r_f",
	"map3_r_d",
	"map3_m_f",
	"map3_m_g",
	"map3_m_h",
	"map3_w_g",
	"map3_l_g",
	"map3_l_h",
	"map3_p_g",
	"map3_p_h",
	"map3_p_i",
	"map3_12_1",
	"map3_12_2",
	"map3_g_g",
	"map3_g_f"
];

var skeletonLeftPoint = [
	"map3_y_f",
	"map3_y_g",
	"map3_10_2",
	"map3_10_1",
	"map3_8_1",
	"map3_8_2",
	"map3_9_1",
	"map3_9_2",
	"map3_11_1",
	"map3_11_2",
	"map3_3_2",
	"map3_3_1",
	"map3_2_1",
	"map3_2_2",
	"map3_u_g",
	"map3_b_g",
	"map3_5_1",
	"map3_5_2",
	"map3_a_g",
	"map3_z_g",
	"map3_d_g",
	"map3_c_g",
	"map3_v_g",
	"map3_i_g",
	"map3_i_h",
	"map3_o_f",
	"map3_o_g",
	"map3_o_h",
	"map3_j_f",
	"map3_j_g",
	"map3_j_h",
	"map3_q_g",
	"map3_k_f",
	"map3_k_g",
	"map3_q_e",
	"map3_q_f",
	"map3_q_d",
	"map3_4_1",
	"map3_4_2"
];

//骨架显示雷达
var skeleton_check_point = '<div class="carskeleton_smaill">' +
						  '	<div class="div_inner_innerdiv_smaill">' +
						  '		<ul id="smaill_u1_3">' +
						  '			<li id="smaill_map3_7_1"></li>' +
						  '			<li id="smaill_map3_7_2"></li>' +
						  '			<li id="smaill_map3_6_1"></li>' +
						  '			<li id="smaill_map3_6_2"></li>' +
						  '			<li id="smaill_map3_6_3"></li>' +
						  '			<li id="smaill_map3_s_g"></li>' +
						  '			<li id="smaill_map3_1_1"></li>' +
						  '			<li id="smaill_map3_t_g"></li>' +
						  '			<li id="smaill_map3_h_g"></li>' +
						  '			<li id="smaill_map3_h_f"></li>' +
						  '			<li id="smaill_map3_r_g"></li>' +
						  '			<li id="smaill_map3_n_g"></li>' +
						  '			<li id="smaill_map3_n_h"></li>' +
						  '			<li id="smaill_map3_r_e"></li>' +
						  '			<li id="smaill_map3_r_f"></li>' +
						  '			<li id="smaill_map3_r_d"></li>' +
						  '			<li id="smaill_map3_m_f"></li>' +
						  '			<li id="smaill_map3_m_g"></li>' +
						  '			<li id="smaill_map3_m_h"></li>' +
						  '			<li id="smaill_map3_w_g"></li>' +
						  '			<li id="smaill_map3_l_g"></li>' +
						  '			<li id="smaill_map3_l_h"></li>' +
						  '			<li id="smaill_map3_p_g"></li>' +
						  '			<li id="smaill_map3_p_h"></li>' +
						  '			<li id="smaill_map3_p_i"></li>' +
						  '			<li id="smaill_map3_y_f"></li>' +
						  '			<li id="smaill_map3_y_g"></li>' +
						  '			<li id="smaill_map3_3_2"></li>' +
						  '			<li id="smaill_map3_3_1"></li>' +
						  '			<li id="smaill_map3_2_1"></li>' +
						  '			<li id="smaill_map3_2_2"></li>' +
						  '			<li id="smaill_map3_u_g"></li>' +
						  '			<li id="smaill_map3_b_g"></li>' +
						  '			<li id="smaill_map3_5_1"></li>' +
						  '			<li id="smaill_map3_5_2"></li>' +
						  '			<li id="smaill_map3_a_g"></li>' +
						  '			<li id="smaill_map3_z_g"></li>' +
						  '			<li id="smaill_map3_d_g"></li>' +
						  '			<li id="smaill_map3_c_g"></li>' +
						  '			<li id="smaill_map3_v_g"></li>' +
						  '			<li id="smaill_map3_i_g"></li>' +
						  '			<li id="smaill_map3_i_h"></li>' +
						  '			<li id="smaill_map3_o_f"></li>' +
						  '			<li id="smaill_map3_o_g"></li>' +
						  '			<li id="smaill_map3_o_h"></li>' +
						  '			<li id="smaill_map3_j_f"></li>' +
						  '			<li id="smaill_map3_j_g"></li>' +
						  '			<li id="smaill_map3_j_h"></li>' +
						  '			<li id="smaill_map3_q_g"></li>' +
						  '			<li id="smaill_map3_k_f"></li>' +
						  '			<li id="smaill_map3_k_g"></li>' +
						  '			<li id="smaill_map3_g_g"></li>' +
						  '			<li id="smaill_map3_g_f"></li>' +
						  '			<li id="smaill_map3_q_e"></li>' +
						  '			<li id="smaill_map3_q_f"></li>' +
						  '			<li id="smaill_map3_q_d"></li>' +
						  '			<li id="smaill_map3_4_1"></li>' +
						  '			<li id="smaill_map3_4_2"></li>' +
						  '			<li id="smaill_map3_10_2"></li>' +
						  '			<li id="smaill_map3_10_1"></li>' +
						  '			<li id="smaill_map3_11_1"></li>' +
						  '			<li id="smaill_map3_11_2"></li>' +
						  '			<li id="smaill_map3_8_1"></li>' +
						  '			<li id="smaill_map3_8_2"></li>' +
						  '			<li id="smaill_map3_9_1"></li>' +
						  '			<li id="smaill_map3_9_2"></li>' +
						  '			<li id="smaill_map3_12_1"></li>' +
						  '			<li id="smaill_map3_12_2"></li>' +
					      '		</ul>' +
						  '	</div>' +
						  '</div>';

//内饰显示雷达
var outher_inner_smaill_brground = ' <div class="carRecessIn_smaill">' +
         '<div class="div_inner_innerdiv_smaill">' +
        '<ul id="smaill_u1_2">' +
                '<li id="smaill_li2_a_a"></li>' +
                '<li id="smaill_li2_a_b"></li>' +
                '<li id="smaill_li2_a_c"></li>' +
                '<li id="smaill_li2_a_d"></li>' +
                '<li id="smaill_li2_a_e"></li>' +
                '<li id="smaill_li2_a_f"></li>' +
                '<li id="smaill_li2_a_g"></li>' +
                '<li id="smaill_li2_a_h"></li>' +
                '<li id="smaill_li2_a_i"></li>' +
                '<li id="smaill_li2_a_j"></li>' +
                '<li id="smaill_li2_a_k"></li>' +
                '<li id="smaill_li2_a_l"></li>' +
                '<li id="smaill_li2_a_m"></li>' +
                '<li id="smaill_li2_b_a"></li>' +
                '<li id="smaill_li2_b_b"></li>' +
                '<li id="smaill_li2_b_c"></li>' +
                '<li id="smaill_li2_b_d"></li>' +
                '<li id="smaill_li2_b_e"></li>' +
                '<li id="smaill_li2_b_f"></li>' +
                '<li id="smaill_li2_b_g"></li>' +
                '<li id="smaill_li2_b_h"></li>' +
                '<li id="smaill_li2_b_i"></li>' +
                '<li id="smaill_li2_b_j"></li>' +
                '<li id="smaill_li2_b_k"></li>' +
                '<li id="smaill_li2_b_l"></li>' +
                '<li id="smaill_li2_b_m"></li>' +
                '<li id="smaill_li2_c_a"></li>' +
                '<li id="smaill_li2_c_b"></li>' +
                '<li id="smaill_li2_c_c"></li>' +
                '<li id="smaill_li2_c_d"></li>' +
                '<li id="smaill_li2_c_e"></li>' +
                '<li id="smaill_li2_c_f"></li>' +
                '<li id="smaill_li2_c_g"></li>' +
                '<li id="smaill_li2_c_h"></li>' +
                '<li id="smaill_li2_c_i"></li>' +
                '<li id="smaill_li2_c_j"></li>' +
                '<li id="smaill_li2_c_k"></li>' +
                '<li id="smaill_li2_c_l"></li>' +
                '<li id="smaill_li2_c_m"></li>' +
                '<li id="smaill_li2_d_a"></li>' +
                '<li id="smaill_li2_d_b"></li>' +
                '<li id="smaill_li2_d_c"></li>' +
                '<li id="smaill_li2_d_d"></li>' +
                '<li id="smaill_li2_d_e"></li>' +
                '<li id="smaill_li2_d_f"></li>' +
                '<li id="smaill_li2_d_g"></li>' +
                '<li id="smaill_li2_d_h"></li>' +
                '<li id="smaill_li2_d_i"></li>' +
                '<li id="smaill_li2_d_j"></li>' +
                '<li id="smaill_li2_d_k"></li>' +
                '<li id="smaill_li2_d_l"></li>' +
                '<li id="smaill_li2_d_m"></li>' +
                '<li id="smaill_li2_e_a"></li>' +
                '<li id="smaill_li2_e_b"></li>' +
                '<li id="smaill_li2_e_c"></li>' +
                '<li id="smaill_li2_e_d"></li>' +
                '<li id="smaill_li2_e_e"></li>' +
                '<li id="smaill_li2_e_f"></li>' +
                '<li id="smaill_li2_e_g"></li>' +
                '<li id="smaill_li2_e_h"></li>' +
                '<li id="smaill_li2_e_i"></li>' +
                '<li id="smaill_li2_e_j"></li>' +
                '<li id="smaill_li2_e_k"></li>' +
                '<li id="smaill_li2_e_l"></li>' +
                '<li id="smaill_li2_e_m"></li>' +
                '<li id="smaill_li2_f_a"></li>' +
                '<li id="smaill_li2_f_b"></li>' +
                '<li id="smaill_li2_f_c"></li>' +
                '<li id="smaill_li2_f_d"></li>' +
                '<li id="smaill_li2_f_e"></li>' +
                '<li id="smaill_li2_f_f"></li>' +
                '<li id="smaill_li2_f_g"></li>' +
                '<li id="smaill_li2_f_h"></li>' +
                '<li id="smaill_li2_f_i"></li>' +
                '<li id="smaill_li2_f_j"></li>' +
                '<li id="smaill_li2_f_k"></li>' +
                '<li id="smaill_li2_f_l"></li>' +
                '<li id="smaill_li2_f_m"></li>' +
                '<li id="smaill_li2_g_a"></li>' +
                '<li id="smaill_li2_g_b"></li>' +
                '<li id="smaill_li2_g_c"></li>' +
                '<li id="smaill_li2_g_d"></li>' +
                '<li id="smaill_li2_g_e"></li>' +
                '<li id="smaill_li2_g_f"></li>' +
                '<li id="smaill_li2_g_g"></li>' +
                '<li id="smaill_li2_g_h"></li>' +
                '<li id="smaill_li2_g_i"></li>' +
                '<li id="smaill_li2_g_j"></li>' +
                '<li id="smaill_li2_g_k"></li>' +
                '<li id="smaill_li2_g_l"></li>' +
                '<li id="smaill_li2_g_m"></li>' +
                '<li id="smaill_li2_h_a"></li>' +
                '<li id="smaill_li2_h_b"></li>' +
                '<li id="smaill_li2_h_c"></li>' +
                '<li id="smaill_li2_h_d"></li>' +
                '<li id="smaill_li2_h_e"></li>' +
                '<li id="smaill_li2_h_f"></li>' +
                '<li id="smaill_li2_h_g"></li>' +
                '<li id="smaill_li2_h_h"></li>' +
                '<li id="smaill_li2_h_i"></li>' +
                '<li id="smaill_li2_h_j"></li>' +
                '<li id="smaill_li2_h_k"></li>' +
                '<li id="smaill_li2_h_l"></li>' +
                '<li id="smaill_li2_h_m"></li>' +
                '<li id="smaill_li2_i_a"></li>' +
                '<li id="smaill_li2_i_b"></li>' +
                '<li id="smaill_li2_i_c"></li>' +
                '<li id="smaill_li2_i_d"></li>' +
                '<li id="smaill_li2_i_e"></li>' +
                '<li id="smaill_li2_i_f"></li>' +
                '<li id="smaill_li2_i_g"></li>' +
                '<li id="smaill_li2_i_h"></li>' +
                '<li id="smaill_li2_i_i"></li>' +
                '<li id="smaill_li2_i_j"></li>' +
                '<li id="smaill_li2_i_k"></li>' +
                '<li id="smaill_li2_i_l"></li>' +
                '<li id="smaill_li2_i_m"></li>' +
                '<li id="smaill_li2_j_a"></li>' +
                '<li id="smaill_li2_j_b"></li>' +
                '<li id="smaill_li2_j_c"></li>' +
                '<li id="smaill_li2_j_d"></li>' +
                '<li id="smaill_li2_j_e"></li>' +
                '<li id="smaill_li2_j_f"></li>' +
                '<li id="smaill_li2_j_g"></li>' +
                '<li id="smaill_li2_j_h"></li>' +
                '<li id="smaill_li2_j_i"></li>' +
                '<li id="smaill_li2_j_j"></li>' +
                '<li id="smaill_li2_j_k"></li>' +
                '<li id="smaill_li2_j_l"></li>' +
                '<li id="smaill_li2_j_m"></li>' +
                '<li id="smaill_li2_k_a"></li>' +
                '<li id="smaill_li2_k_b"></li>' +
                '<li id="smaill_li2_k_c"></li>' +
                '<li id="smaill_li2_k_d"></li>' +
                '<li id="smaill_li2_k_e"></li>' +
                '<li id="smaill_li2_k_f"></li>' +
                '<li id="smaill_li2_k_g"></li>' +
                '<li id="smaill_li2_k_h"></li>' +
                '<li id="smaill_li2_k_i"></li>' +
                '<li id="smaill_li2_k_j"></li>' +
                '<li id="smaill_li2_k_k"></li>' +
                '<li id="smaill_li2_k_l"></li>' +
                '<li id="smaill_li2_k_m"></li>' +
                '<li id="smaill_li2_l_a"></li>' +
                '<li id="smaill_li2_l_b"></li>' +
                '<li id="smaill_li2_l_c"></li>' +
                '<li id="smaill_li2_l_d"></li>' +
                '<li id="smaill_li2_l_e"></li>' +
                '<li id="smaill_li2_l_f"></li>' +
                '<li id="smaill_li2_l_g"></li>' +
                '<li id="smaill_li2_l_h"></li>' +
                '<li id="smaill_li2_l_i"></li>' +
                '<li id="smaill_li2_l_j"></li>' +
                '<li id="smaill_li2_l_k"></li>' +
                '<li id="smaill_li2_l_l"></li>' +
                '<li id="smaill_li2_l_m"></li>' +
                '<li id="smaill_li2_m_a"></li>' +
                '<li id="smaill_li2_m_b"></li>' +
                '<li id="smaill_li2_m_c"></li>' +
                '<li id="smaill_li2_m_d"></li>' +
                '<li id="smaill_li2_m_e"></li>' +
                '<li id="smaill_li2_m_f"></li>' +
                '<li id="smaill_li2_m_g"></li>' +
                '<li id="smaill_li2_m_h"></li>' +
                '<li id="smaill_li2_m_i"></li>' +
                '<li id="smaill_li2_m_j"></li>' +
                '<li id="smaill_li2_m_k"></li>' +
                '<li id="smaill_li2_m_l"></li>' +
                '<li id="smaill_li2_m_m"></li>' +
                '<li id="smaill_li2_n_a"></li>' +
                '<li id="smaill_li2_n_b"></li>' +
                '<li id="smaill_li2_n_c"></li>' +
                '<li id="smaill_li2_n_d"></li>' +
                '<li id="smaill_li2_n_e"></li>' +
                '<li id="smaill_li2_n_f"></li>' +
                '<li id="smaill_li2_n_g"></li>' +
                '<li id="smaill_li2_n_h"></li>' +
                '<li id="smaill_li2_n_i"></li>' +
                '<li id="smaill_li2_n_j"></li>' +
                '<li id="smaill_li2_n_k"></li>' +
                '<li id="smaill_li2_n_l"></li>' +
                '<li id="smaill_li2_n_m"></li>' +
            '</ul>' +
        '</div>' +
        '</div>';
//显示外观雷达
var outher_smaill_brground = '<div  class="carRecessOut_smaill" >' +
       '<div class="div_out_innerdiv_smaill">' +
        '<ul id="u1_1_smaill">' +
        '<li id="small_li1_a_a"></li>' +
        '<li id="small_li1_a_b"></li>' +
        '<li id="small_li1_a_c"></li>' +
        '<li id="small_li1_a_d"></li>' +
        '<li id="small_li1_a_e"></li>' +
        '<li id="small_li1_a_f"></li>' +
        '<li id="small_li1_a_g"></li>' +
        '<li id="small_li1_a_h"></li>' +
        '<li id="small_li1_a_i"></li>' +
        '<li id="small_li1_a_j"></li>' +
        '<li id="small_li1_a_k"></li>' +
        '<li id="small_li1_a_l"></li>' +
        '<li id="small_li1_a_m"></li>' +
        '<li id="small_li1_b_a"></li>' +
        '<li id="small_li1_b_b"></li>' +
        '<li id="small_li1_b_c"></li>' +
        '<li id="small_li1_b_d"></li>' +
        '<li id="small_li1_b_e"></li>' +
        '<li id="small_li1_b_f"></li>' +
        '<li id="small_li1_b_g"></li>' +
        '<li id="small_li1_b_h"></li>' +
        '<li id="small_li1_b_i"></li>' +
        '<li id="small_li1_b_j"></li>' +
        '<li id="small_li1_b_k"></li>' +
        '<li id="small_li1_b_l"></li>' +
        '<li id="small_li1_b_m"></li>' +
        '<li id="small_li1_c_a"></li>' +
        '<li id="small_li1_c_b"></li>' +
        '<li id="small_li1_c_c"></li>' +
        '<li id="small_li1_c_d"></li>' +
        '<li id="small_li1_c_e"></li>' +
        '<li id="small_li1_c_f"></li>' +
        '<li id="small_li1_c_g"></li>' +
        '<li id="small_li1_c_h"></li>' +
        '<li id="small_li1_c_i"></li>' +
        '<li id="small_li1_c_j"></li>' +
        '<li id="small_li1_c_k"></li>' +
        '<li id="small_li1_c_l"></li>' +
        '<li id="small_li1_c_m"></li>' +
        '<li id="small_li1_d_a"></li>' +
        '<li id="small_li1_d_b"></li>' +
        '<li id="small_li1_d_c"></li>' +
        '<li id="small_li1_d_d"></li>' +
        '<li id="small_li1_d_e"></li>' +
        '<li id="small_li1_d_f"></li>' +
        '<li id="small_li1_d_g"></li>' +
        '<li id="small_li1_d_h"></li>' +
        '<li id="small_li1_d_i"></li>' +
        '<li id="small_li1_d_j"></li>' +
        '<li id="small_li1_d_k"></li>' +
        '<li id="small_li1_d_l"></li>' +
        '<li id="small_li1_d_m"></li>' +
        '<li id="small_li1_e_a"></li>' +
        '<li id="small_li1_e_b"></li>' +
        '<li id="small_li1_e_c" ></li>' +
        '<li id="small_li1_e_d"></li>' +
        '<li id="small_li1_e_e"></li>' +
        '<li id="small_li1_e_f"></li>' +
        '<li id="small_li1_e_g" ></li>' +
        '<li id="small_li1_e_h"></li>' +
        '<li id="small_li1_e_i"></li>' +
        '<li id="small_li1_e_j"></li>' +
        '<li id="small_li1_e_k" ></li>' +
        '<li id="small_li1_e_l"></li>' +
        '<li id="small_li1_e_m"></li>' +
        '<li id="small_li1_f_a"></li>' +
        '<li id="small_li1_f_b"></li>' +
        '<li id="small_li1_f_c"></li>' +
        '<li id="small_li1_f_d"></li>' +
        '<li id="small_li1_f_e"></li>' +
        '<li id="small_li1_f_f"></li>' +
        '<li id="small_li1_f_g"></li>' +
        '<li id="small_li1_f_h"></li>' +
        '<li id="small_li1_f_i"></li>' +
        '<li id="small_li1_f_j"></li>' +
        '<li id="small_li1_f_k"></li>' +
        '<li id="small_li1_f_l"></li>' +
        '<li id="small_li1_f_m"></li>' +
        '<li id="small_li1_g_a"></li>' +
        '<li id="small_li1_g_b"></li>' +
        '<li id="small_li1_g_c"></li>' +
        '<li id="small_li1_g_d"></li>' +
        '<li id="small_li1_g_e"></li>' +
        '<li id="small_li1_g_f"></li>' +
        '<li id="small_li1_g_g"></li>' +
        '<li id="small_li1_g_h"></li>' +
        '<li id="small_li1_g_i"></li>' +
        '<li id="small_li1_g_j"></li>' +
        '<li id="small_li1_g_k"></li>' +
        '<li id="small_li1_g_l"></li>' +
        '<li id="small_li1_g_m"></li>' +
        '<li id="small_li1_h_a"></li>' +
        '<li id="small_li1_h_b"></li>' +
        '<li id="small_li1_h_c"></li>' +
        '<li id="small_li1_h_d"></li>' +
        '<li id="small_li1_h_e"></li>' +
        '<li id="small_li1_h_f"></li>' +
        '<li id="small_li1_h_g" ></li>' +
        '<li id="small_li1_h_h"></li>' +
        '<li id="small_li1_h_i"></li>' +
        '<li id="small_li1_h_j"></li>' +
        '<li id="small_li1_h_k"></li>' +
        '<li id="small_li1_h_l"></li>' +
        '<li id="small_li1_h_m"></li>' +
        '<li id="small_li1_i_a"></li>' +
        '<li id="small_li1_i_b" ></li>' +
        '<li id="small_li1_i_c"></li>' +
        '<li id="small_li1_i_d"></li>' +
        '<li id="small_li1_i_e"></li>' +
        '<li id="small_li1_i_f"></li>' +
        '<li id="small_li1_i_g"></li>' +
        '<li id="small_li1_i_h"></li>' +
        '<li id="small_li1_i_i"></li>' +
        '<li id="small_li1_i_j"></li>' +
        '<li id="small_li1_i_k"></li>' +
        '<li id="small_li1_i_l"></li>' +
        '<li id="small_li1_i_m"></li>' +
        '<li id="small_li1_j_a"></li>' +
        '<li id="small_li1_j_b"></li>' +
        '<li id="small_li1_j_c"></li>' +
        '<li id="small_li1_j_d"></li>' +
        '<li id="small_li1_j_e"></li>' +
        '<li id="small_li1_j_f"></li>' +
        '<li id="small_li1_j_g" ></li>' +
        '<li id="small_li1_j_h"></li>' +
        '<li id="small_li1_j_i"></li>' +
        '<li id="small_li1_j_j"></li>' +
        '<li id="small_li1_j_k" ></li>' +
        '<li id="small_li1_j_l"></li>' +
        '<li id="small_li1_j_m"></li>' +
        '<li id="small_li1_k_a"></li>' +
        '<li id="small_li1_k_b"></li>' +
        '<li id="small_li1_k_c"></li>' +
        '<li id="small_li1_k_d"></li>' +
        '<li id="small_li1_k_e"></li>' +
        '<li id="small_li1_k_f"></li>' +
        '<li id="small_li1_k_g"></li>' +
        '<li id="small_li1_k_h"></li>' +
        '<li id="small_li1_k_i"></li>' +
        '<li id="small_li1_k_j"></li>' +
        '<li id="small_li1_k_k"></li>' +
        '<li id="small_li1_k_l"></li>' +
        '<li id="small_li1_k_m"></li>' +
        '<li id="small_li1_l_a"></li>' +
        '<li id="small_li1_l_b"></li>' +
        '<li id="small_li1_l_c"></li>' +
        '<li id="small_li1_l_d"></li>' +
        '<li id="small_li1_l_e"></li>' +
        '<li id="small_li1_l_f"></li>' +
        '<li id="small_li1_l_g"></li>' +
        '<li id="small_li1_l_h"></li>' +
        '<li id="small_li1_l_i"></li>' +
        '<li id="small_li1_l_j"></li>' +
        '<li id="small_li1_l_k" ></li>' +
        '<li id="small_li1_l_l"></li>' +
        '<li id="small_li1_l_m"></li>' +
        '<li id="small_li1_m_a"></li>' +
        '<li id="small_li1_m_b" ></li>' +
        '<li id="small_li1_m_c"></li>' +
        '<li id="small_li1_m_d"></li>' +
        '<li id="small_li1_m_e"></li>' +
        '<li id="small_li1_m_f"></li>' +
        '<li id="small_li1_m_g"></li>' +
        '<li id="small_li1_m_h"></li>' +
        '<li id="small_li1_m_i"></li>' +
        '<li id="small_li1_m_j"></li>' +
        '<li id="small_li1_m_k"></li>' +
        '<li id="small_li1_m_l"></li>' +
        '<li id="small_li1_m_m"></li>' +
        '<li id="small_li1_n_a"></li>' +
        '<li id="small_li1_n_b"></li>' +
        '<li id="small_li1_n_c"></li>' +
        '<li id="small_li1_n_d"></li>' +
        '<li id="small_li1_n_e"></li>' +
        '<li id="small_li1_n_f"></li>' +
        '<li id="small_li1_n_g"></li>' +
        '<li id="small_li1_n_h"></li>' +
        '<li id="small_li1_n_i"></li>' +
        '<li id="small_li1_n_j"></li>' +
        '<li id="small_li1_n_k"></li>' +
        '<li id="small_li1_n_l"></li>' +
        '<li id="small_li1_n_m"></li>' +
        '<li id="small_li1_o_a"></li>' +
        '<li id="small_li1_o_b"></li>' +
        '<li id="small_li1_o_c"></li>' +
        '<li id="small_li1_o_d"></li>' +
        '<li id="small_li1_o_e"></li>' +
        '<li id="small_li1_o_f"></li>' +
        '<li id="small_li1_o_g"></li>' +
        '<li id="small_li1_o_h"></li>' +
        '<li id="small_li1_o_i"></li>' +
        '<li id="small_li1_o_j"></li>' +
        '<li id="small_li1_o_k"></li>' +
        '<li id="small_li1_o_l"></li>' +
        '<li id="small_li1_o_m"></li>' +
        '<li id="small_li1_p_a"></li>' +
        '<li id="small_li1_p_b"></li>' +
        '<li id="small_li1_p_c" ></li>' +
        '<li id="small_li1_p_d"></li>' +
        '<li id="small_li1_p_e"></li>' +
        '<li id="small_li1_p_f"></li>' +
        '<li id="small_li1_p_g"></li>' +
        '<li id="small_li1_p_h"></li>' +
        '<li id="small_li1_p_i"></li>' +
        '<li id="small_li1_p_j"></li>' +
        '<li id="small_li1_p_k" ></li>' +
        '<li id="small_li1_p_l"></li>' +
        '<li id="small_li1_p_m"></li>' +
        '<li id="small_li1_q_a"></li>' +
        '<li id="small_li1_q_b"></li>' +
        '<li id="small_li1_q_c"></li>' +
        '<li id="small_li1_q_d"></li>' +
        '<li id="small_li1_q_e"></li>' +
        '<li id="small_li1_q_f" ></li>' +
        '<li id="small_li1_q_g"></li>' +
        '<li id="small_li1_q_h"></li>' +
        '<li id="small_li1_q_i"></li>' +
        '<li id="small_li1_q_j"></li>' +
        '<li id="small_li1_q_k"></li>' +
        '<li id="small_li1_q_l"></li>' +
        '<li id="small_li1_q_m"></li>' +
        '<li id="small_li1_r_a"></li>' +
        '<li id="small_li1_r_b"></li>' +
        '<li id="small_li1_r_c"></li>' +
        '<li id="small_li1_r_d"></li>' +
        '<li id="small_li1_r_e"></li>' +
        '<li id="small_li1_r_f"></li>' +
        '<li id="small_li1_r_g"></li>' +
        '<li id="small_li1_r_h"></li>' +
        '<li id="small_li1_r_i"></li>' +
        '<li id="small_li1_r_j"></li>' +
        '<li id="small_li1_r_k"></li>' +
        '<li id="small_li1_r_l"></li>' +
        '<li id="small_li1_r_m"></li>' +
        '<li id="small_li1_s_a"></li>' +
        '<li id="small_li1_s_b"></li>' +
        '<li id="small_li1_s_c"></li>' +
        '<li id="small_li1_s_d"></li>' +
        '<li id="small_li1_s_e"></li>' +
        '<li id="small_li1_s_f"></li>' +
        '<li id="small_li1_s_g"></li>' +
        '<li id="small_li1_s_h" ></li>' +
        '<li id="small_li1_s_i"></li>' +
        '<li id="small_li1_s_j"></li>' +
        '<li id="small_li1_s_k"></li>' +
        '<li id="small_li1_s_l"></li>' +
        '<li id="small_li1_s_m"></li>' +
        '<li id="small_li1_t_a"></li>' +
        '<li id="small_li1_t_b"></li>' +
        '<li id="small_li1_t_c"></li>' +
        '<li id="small_li1_t_d"></li>' +
        '<li id="small_li1_t_e" ></li>' +
        '<li id="small_li1_t_f"></li>' +
        '<li id="small_li1_t_g"></li>' +
        '<li id="small_li1_t_h"></li>' +
        '<li id="small_li1_t_i" ></li>' +
        '<li id="small_li1_t_j"></li>' +
        '<li id="small_li1_t_k"></li>' +
        '<li id="small_li1_t_l"></li>' +
        '<li id="small_li1_t_m"></li>' +
        '<li id="small_li1_u_a"></li>' +
        '<li id="small_li1_u_b"></li>' +
        '<li id="small_li1_u_c"></li>' +
        '<li id="small_li1_u_d"></li>' +
        '<li id="small_li1_u_e"></li>' +
        '<li id="small_li1_u_f"></li>' +
        '<li id="small_li1_u_g"></li>' +
        '<li id="small_li1_u_h"></li>' +
        '<li id="small_li1_u_i"></li>' +
        '<li id="small_li1_u_j"></li>' +
        '<li id="small_li1_u_k"></li>' +
        '<li id="small_li1_u_l"></li>' +
        '<li id="small_li1_u_m"></li>' +
        '</ul>' +
        '</div>';
//车身18张图片
var CarInfor_Imglist = [
{ "name": "左前45度", "areamap": "6", "index": 0, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前水箱框架", "areamap": "27", "index": 1, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左侧避震器底座", "areamap": "31", "index": 2, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左A柱", "areamap": "5", "index": 3, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "中控与方向盘", "areamap": "28", "index": 4, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左B柱", "areamap": "10", "index": 5, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左C柱", "areamap": "7", "index": 6, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后翼子板角", "areamap": "26", "index": 7, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后备箱底板", "areamap": "32", "index": 8, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后翼子板角", "areamap": "8", "index": 9, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后备箱底板", "areamap": "9", "index": 10, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后45度", "areamap": "33", "index": 11, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右C柱", "areamap": "34", "index": 12, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右B柱", "areamap": "30", "index": 13, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右A柱", "areamap": "29", "index": 14, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右侧避震器底座", "areamap": "16", "index": 15, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前水箱框架", "areamap": "13", "index": 16, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "行驶本", "areamap": "4", "index": 17, "show_txt": "", "show_img": "", "show_big_img": "" }
];
//内饰区域
var inner_dic_AreaMap = [
{ "name": "仪表台", "areamap": "F1", "index": 0, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "扶手箱", "areamap": "F2", "index": 1, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "驾驶座椅", "areamap": "G1", "index": 2, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前门饰板", "areamap": "G2", "index": 3, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后门饰板", "areamap": "G3", "index": 4, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "副驾驶座椅", "areamap": "H1", "index": 5, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前门饰板", "areamap": "H2", "index": 6, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后门饰板", "areamap": "H3", "index": 7, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后排座椅", "areamap": "I3", "index": 8, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "顶棚", "areamap": "J1", "index": 9, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后备箱", "areamap": "I1", "index": 10, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "中控台", "areamap": "F4", "index": 11, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "方向盘", "areamap": "F6", "index": 12, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "手套箱", "areamap": "F3", "index": 13, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "档把", "areamap": "F5", "index": 14, "show_txt": "", "show_img": "", "show_big_img": "" }
];
//外观区域
var outher_dic_AreaMap = [
{ "name": "前保险杠", "areamap": "A1", "index": 0, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前大灯", "areamap": "A3", "index": 1, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前机盖", "areamap": "A2", "index": 2, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前风挡", "areamap": "A4", "index": 3, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "倒视镜", "areamap": "A5", "index": 4, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前翼子板", "areamap": "B1", "index": 5, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前轮", "areamap": "K1", "index": 6, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前门", "areamap": "B2", "index": 7, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前门玻璃", "areamap": "B5", "index": 8, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左底板", "areamap": "B7", "index": 9, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后门", "areamap": "B3", "index": 10, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后门玻璃", "areamap": "B6", "index": 11, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后翼子板", "areamap": "B4", "index": 12, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后轮", "areamap": "K3", "index": 13, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "车顶", "areamap": "E1", "index": 14, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后风挡", "areamap": "D4", "index": 15, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后备箱盖", "areamap": "D2", "index": 16, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后尾灯", "areamap": "D3", "index": 17, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后保险杠", "areamap": "D1", "index": 18, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前翼子板", "areamap": "C1", "index": 19, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前轮", "areamap": "K2", "index": 20, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前门", "areamap": "C2", "index": 21, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前门玻璃", "areamap": "C5", "index": 22, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右底板", "areamap": "C7", "index": 23, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后门", "areamap": "C3", "index": 24, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后门玻璃", "areamap": "C6", "index": 25, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后翼子板", "areamap": "C4", "index": 26, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后轮", "areamap": "K4", "index": 27, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "备胎", "areamap": "K5", "index": 28, "show_txt": "", "show_img": "", "show_big_img": "" }
];

//骨架的显性损伤左前45度区域
var skele_dic_AreaMap_Left = [
{ "name": "前机盖", "index": 0, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "水箱框架", "index": 1, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前纵梁", "index": 2, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前防火墙", "index": 3, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左前翼子板", "index": 4, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右前翼子板", "index": 5, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左A柱", "index": 6, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左B柱", "index": 7, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左C柱", "index": 8, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左侧底边", "index": 9, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左侧顶边", "index": 10, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "减震器支架", "index": 11, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前轮旋", "index": 12, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前大灯座", "index": 13, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前防撞梁", "index": 14, "show_txt": "", "show_img": "", "show_big_img": "" }
];

//骨架的显性损伤区域
var skele_dic_AreaMap = [
{ "name": "水箱框架左", "areamap": "3_a_g", "index": 1, "areamapid": "L1", "type": "Left" },
{ "name": "防火墙左部", "areamap": "3_b_g", "index": 3, "areamapid": "L2", "type": "Left" },
{ "name": "左前纵梁", "areamap": "3_c_g", "index": 2, "areamapid": "L3", "type": "Left" },
{ "name": "右前纵梁", "areamap": "3_d_g", "index": 2, "areamapid": "L4", "type": "Left" },
{ "name": "左前翼子板前", "areamap": "3_e_g", "index": 4, "areamapid": "L5", "type": "Left" },
{ "name": "左前翼子板后", "areamap": "3_e_h", "index": 4, "areamapid": "L38", "type": "Left" },
{ "name": "右前翼子板前", "areamap": "3_f_g", "index": 5, "areamapid": "L6", "type": "Left" },
{ "name": "右前翼子板后", "areamap": "3_f_h", "index": 5, "areamapid": "L60", "type": "Left" },
{ "name": "左前轮旋", "areamap": "3_9_1", "index": 12, "areamapid": "L67", "type": "Left" },
{ "name": "左前减震支架", "areamap": "3_8_1", "index": 11, "areamapid": "L65", "type": "Left" },
{ "name": "右前轮旋", "areamap": "3_9_2", "index": 12, "areamapid": "L68", "type": "Left" },
{ "name": "右前减震支架", "areamap": "3_8_2", "index": 11, "areamapid": "L66", "type": "Left" },
{ "name": "左前机盖铰链", "areamap": "3_10_1", "index": 0, "areamapid": "L69", "type": "Left" },
{ "name": "右前机盖铰链", "areamap": "3_10_2", "index": 0, "areamapid": "L70", "type": "Left" },
{ "name": "左纵梁前端", "areamap": "3_11_1", "index": 2, "areamapid": "L71", "type": "Left" },
{ "name": "右纵梁前端", "areamap": "3_11_2", "index": 2, "areamapid": "L72", "type": "Left" },
{ "name": "左A柱上", "areamap": "3_i_g", "index": 6, "areamapid": "L9", "type": "Left" },
{ "name": "左A柱下", "areamap": "3_i_h", "index": 6, "areamapid": "L33", "type": "Left" },
{ "name": "左B柱上", "areamap": "3_j_f", "index": 7, "areamapid": "L34", "type": "Left" },
{ "name": "左B柱中", "areamap": "3_j_g", "index": 7, "areamapid": "L10", "type": "Left" },
{ "name": "左B柱下", "areamap": "3_j_h", "index": 7, "areamapid": "L35", "type": "Left" },
{ "name": "左C柱上", "areamap": "3_k_f", "index": 8, "areamapid": "L39", "type": "Left" },
{ "name": "左C柱下", "areamap": "3_k_g", "index": 8, "areamapid": "L11", "type": "Left" },
{ "name": "左前门口上", "areamap": "3_o_f", "index": 10, "areamapid": "L41", "type": "Left" },
{ "name": "左前门口下", "areamap": "3_o_g", "index": 9, "areamapid": "L15", "type": "Left" },
{ "name": "左侧底梁前", "areamap": "3_o_h", "index": 9, "areamapid": "L42", "type": "Left" },
{ "name": "左侧底梁后", "areamap": "3_q_d", "index": 9, "areamapid": "L22", "type": "Left" },
{ "name": "左后门口上", "areamap": "3_q_e", "index": 8, "areamapid": "L21", "type": "Left" },
{ "name": "左后门口下", "areamap": "3_q_f", "index": 8, "areamapid": "L40", "type": "Left" },
/*{ "name": "左后门口中事故痕迹", "areamap": "3_q_f", "index": 2, "areamapid": "L20" ,"type":"Left"},//新版没有使用的点位*/
{"name": "左顶梁后", "areamap": "3_q_g", "index": 8, "areamapid": "L17", "type": "Left" },
{ "name": "防火墙右部", "areamap": "3_u_g", "index": 3, "areamapid": "L31", "type": "Left" },
{ "name": "左顶梁前", "areamap": "3_v_g", "index": 10, "areamapid": "L29", "type": "Left" },
{ "name": "前机盖内缘右", "areamap": "3_y_f", "index": 0, "areamapid": "L27", "type": "Left" },
{ "name": "前机盖内缘左", "areamap": "3_y_g", "index": 0, "areamapid": "L26", "type": "Left" },
{ "name": "水箱框架右", "areamap": "3_z_g", "index": 1, "areamapid": "L32", "type": "Left" },
{ "name": "左前梁前", "areamap": "3_2_1", "index": 2, "areamapid": "L43", "type": "Left" },
{ "name": "左前梁后", "areamap": "3_2_2", "index": 2, "areamapid": "L44", "type": "Left" },
{ "name": "右前梁前", "areamap": "3_3_1", "index": 2, "areamapid": "L45", "type": "Left" },
{ "name": "右前梁后", "areamap": "3_3_2", "index": 2, "areamapid": "L46", "type": "Left" },
{ "name": "前防撞梁右", "areamap": "3_4_1", "index": 14, "areamapid": "L47", "type": "Left" },
{ "name": "前防撞梁左", "areamap": "3_4_2", "index": 14, "areamapid": "L48", "type": "Left" },
{ "name": "右大灯底座", "areamap": "3_5_1", "index": 13, "areamapid": "L49", "type": "Left" },
{ "name": "左大灯底座", "areamap": "3_5_2", "index": 13, "areamapid": "L50", "type": "Left" },
{ "name": "右顶梁前", "areamap": "3_w_g", "index": 10, "areamapid": "L28", "type": "Right" },
{ "name": "后备箱底板左", "areamap": "3_6_1", "index": 2, "areamapid": "L51", "type": "Right" },
{ "name": "后备箱底板中", "areamap": "3_6_2", "index": 2, "areamapid": "L52", "type": "Right" },
{ "name": "后备箱底板右", "areamap": "3_6_3", "index": 2, "areamapid": "L53", "type": "Right" },
{ "name": "后备箱盖内缘左", "areamap": "3_7_1", "index": 0, "areamapid": "L54", "type": "Right" },
{ "name": "后备箱盖内缘右", "areamap": "3_7_2", "index": 0, "areamapid": "L55", "type": "Right" },
{ "name": "左后备箱铰链", "areamap": "3_12_1", "index": 0, "areamapid": "L73", "type": "Right" },
{ "name": "右后备箱铰链", "areamap": "3_12_2", "index": 0, "areamapid": "L74", "type": "Right" },
{ "name": "左后翼子板前", "areamap": "3_g_f", "index": 4, "areamapid": "L37", "type": "Right" },
{ "name": "左后翼子板后", "areamap": "3_g_g", "index": 4, "areamapid": "L7", "type": "Right" },
{ "name": "右后翼子板前", "areamap": "3_h_f", "index": 5, "areamapid": "L63", "type": "Right" },
{ "name": "右后翼子板后", "areamap": "3_h_g", "index": 5, "areamapid": "L8", "type": "Right" },
{ "name": "右A柱上", "areamap": "3_l_g", "index": 6, "areamapid": "L12", "type": "Right" },
{ "name": "右A柱下", "areamap": "3_l_h", "index": 6, "areamapid": "L57", "type": "Right" },
{ "name": "右B柱上", "areamap": "3_m_f", "index": 7, "areamapid": "L58", "type": "Right" },
{ "name": "右B柱中", "areamap": "3_m_g", "index": 7, "areamapid": "L13", "type": "Right" },
{ "name": "右B柱下", "areamap": "3_m_h", "index": 7, "areamapid": "L59", "type": "Right" },
{ "name": "右C柱上", "areamap": "3_n_g", "index": 8, "areamapid": "L14", "type": "Right" },
{ "name": "右C柱下", "areamap": "3_n_h", "index": 8, "areamapid": "L56", "type": "Right" },
{ "name": "右底梁后", "areamap": "3_r_d", "index": 8, "areamapid": "L25", "type": "Right" },
{ "name": "右后门口上", "areamap": "3_r_e", "index": 8, "areamapid": "L24", "type": "Right" },
{ "name": "右后门口下", "areamap": "3_r_f", "index": 8, "areamapid": "L61", "type": "Right" },
/*{ "name": "右后门口中事故痕迹", "areamap": "3_r_f", "index": 7, "areamapid": "L23" ,"type":"Right"},//新版没有使用的点位	*/
{"name": "右顶梁后", "areamap": "3_r_g", "index": 10, "areamapid": "L18", "type": "Right" },
{ "name": "后围板左", "areamap": "3_s_g", "index": 1, "areamapid": "L19", "type": "Right" },
{ "name": "后围板中", "areamap": "3_1_1", "index": 1, "areamapid": "L36", "type": "Right" },
{ "name": "后围板右", "areamap": "3_t_g", "index": 1, "areamapid": "L30", "type": "Right" },
{ "name": "右前门口上", "areamap": "3_p_g", "index": 10, "areamapid": "L16", "type": "Right" },
{ "name": "右前门口下", "areamap": "3_p_h", "index": 9, "areamapid": "L64", "type": "Right" },
{ "name": "右底梁前", "areamap": "3_p_i", "index": 9, "areamapid": "L62", "type": "Right" }
];
//骨架的显性损伤右后45度侧区域
var skele_dic_AreaMap_Right = [
{ "name": "后备箱盖", "index": 0, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后备箱尾板", "index": 1, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "后备箱底板", "index": 2, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "前防火墙", "index": 3, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "左后翼子板", "index": 4, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右后翼子板", "index": 5, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右A柱", "index": 6, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右B柱", "index": 7, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右C柱", "index": 8, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右侧底边", "index": 9, "show_txt": "", "show_img": "", "show_big_img": "" },
{ "name": "右侧顶边", "index": 10, "show_txt": "", "show_img": "", "show_big_img": "" }
];
//外观检测类型
var outher_dic_detectType = [
{ "key": "B1", "name": "塑型" }, { "key": "B2", "name": "划伤" }, { "key": "B3", "name": "锈蚀" },
{ "key": "B4", "name": "龟裂" }, { "key": "B5", "name": "色差" }, { "key": "B6", "name": "凹坑" },
{ "key": "B7", "name": "伤及漆面凹坑" }, { "key": "B8", "name": "生锈" }, { "key": "B9", "name": "腐蚀" },
{ "key": "B10", "name": "腻子痕迹" }, { "key": "B11", "name": "砂纸痕" }, { "key": "B12", "name": "砂眼" },
{ "key": "B13", "name": "漆面橘皮/垂流" }, { "key": "B14", "name": "皲裂起皱" }, { "key": "B15", "name": "局部色差" },
{ "key": "C1", "name": "磨平" }, { "key": "C2", "name": "鼓包" }, { "key": "C3", "name": "轮毂伤" },
{ "key": "C4", "name": "轮胎品牌/花纹不一致" }, { "key": "C5", "name": "准新胎" }, { "key": "C6", "name": "需更换" },
{ "key": "C7", "name": "侧壁擦伤" }, { "key": "D1", "name": "裂痕" },
{ "key": "D2", "name": "划痕" }, { "key": "D3", "name": "凹坑" }, { "key": "D4", "name": "飞石砸伤" },
{ "key": "D5", "name": "雨刷划痕/划刻痕迹" }, { "key": "D6", "name": "需更换" },
{ "key": "F1", "name": "灯罩裂痕" }, { "key": "F2", "name": "灯座破裂" }, { "key": "F3", "name": "进水" },
{ "key": "F4", "name": "进灰" }, { "key": "F5", "name": "松旷" }, { "key": "F6", "name": "左右颜色不一致" },
{ "key": "G1", "name": "擦伤" }, { "key": "G2", "name": "小破损" }, { "key": "G3", "name": "变形" }, { "key": "G4", "name": "裂口" },
{ "key": "G5", "name": "轮毂饰盖损坏/丢失" }
];
//内饰检测类型
var inner_dic_detectType = [
{ "key": "E1", "name": "无胶" },
						  { "key": "E2", "name": "塑型差异" },
						  { "key": "E3", "name": "裂痕" },
						  { "key": "E4", "name": "锈蚀" },
						  { "key": "E5", "name": "弯曲" },
						  { "key": "E6", "name": "凹陷" },
						  { "key": "E7", "name": "钣金胶差异" },
						  { "key": "E8", "name": "钣金痕迹" },
						  { "key": "E9", "name": "切割痕迹" },
						  { "key": "E10", "name": "拆卸痕迹" },
						  { "key": "E11", "name": "变形未修理" },
{ "key": "A1", "name": "裂痕" }, { "key": "A2", "name": "破损" }, { "key": "A3", "name": "松旷" },
{ "key": "A4", "name": "烧痕" }, { "key": "A5", "name": "缺失" }, { "key": "A6", "name": "严重污迹" },
{ "key": "A7", "name": "磨损" }, { "key": "A8", "name": "烧痕/烟洞" }, { "key": "A9", "name": "污损" },
{ "key": "A10", "name": "裂口/破开" }, { "key": "A11", "name": "塌陷/下垂" }, { "key": "A12", "name": "摇动/松旷" }, { "key": "A13", "name": "头枕丢失" }, { "key": "A14", "name": "座椅遗失" }, { "key": "A15", "name": "泡水痕迹" }, { "key": "A16", "name": "裂开/破口" }, { "key": "A17", "name": "歪曲/松垮" }, { "key": "A18", "name": "焦痕/烧痕" }, { "key": "A19", "name": "变色/褪色" }, { "key": "A20", "name": "改动安装孔" }, { "key": "A21", "name": "胶水痕迹" }, { "key": "A22", "name": "部件不全" }, { "key": "A23", "name": "裂开/破口" }, { "key": "A24", "name": "歪曲/松垮" }, { "key": "A25", "name": "焦痕/烧痕" }, { "key": "A26", "name": "变色/褪色" }, { "key": "A27", "name": "改动安装孔" }, { "key": "A28", "name": "胶水痕迹" }, { "key": "A29", "name": "松垮" }, { "key": "A30", "name": "磨损" }, { "key": "A31", "name": "需更换" }, { "key": "A32", "name": "裂开/破口" }, { "key": "A33", "name": "磨损" }, { "key": "A34", "name": "焦痕/烧痕" }, { "key": "A35", "name": "护套需更换" }, { "key": "A36", "name": "污损" }, { "key": "A37", "name": "烧痕/烟洞" }, { "key": "A38", "name": "裂开/破口" }, { "key": "A39", "name": "胶水痕迹" }, { "key": "A40", "name": "泡水痕迹" }, { "key": "A41", "name": "污损" }, { "key": "A42", "name": "烧痕/烟洞" }, { "key": "A43", "name": "裂开/破口" }, { "key": "A44", "name": "下垂" }, { "key": "A45", "name": "泡水痕迹" }, { "key": "A46", "name": "裂痕" }, { "key": "A47", "name": "严重磨损" }, { "key": "A48", "name": "饰盖松垮" }, { "key": "A49", "name": "裂痕/破口" }
];
//骨架检测类型
var skele_dic_detectType = [
						  { "key": "E1", "name": "无胶" },
						  { "key": "E2", "name": "塑型差异" },
						  { "key": "E3", "name": "裂痕" },
						  { "key": "E4", "name": "锈蚀" },
						  { "key": "E5", "name": "弯曲" },
						  { "key": "E6", "name": "凹陷" },
						  { "key": "E7", "name": "钣金胶差异" },
						  { "key": "E8", "name": "钣金痕迹" },
						  { "key": "E9", "name": "切割痕迹" },
						  { "key": "E10", "name": "拆卸痕迹" },
						  { "key": "E11", "name": "变形未修理" }
];

/*
//外观可点击区域
var outher_dic_ArealiId = [
{ "area": "A1", "data": "1_a_d,1_a_e,1_a_f,1_a_g,1_a_h,1_a_i,1_a_j,1_b_d,1_b_e,1_b_f,1_b_g,1-7,1-8,1-9,2-5,2-6,2-7" },
{ "area": "A3", "data": "2-4,2-8" },
{ "area": "A2", "data": "3-4,3-5,3-6,3-7,3-8,4-4,4-5,4-6,4-7,4-8,5-4,5-5,5-6,5-7,5-8" },
{ "area": "A4", "data": "6-4,6-5,6-6,6-7,6-8,7-4,7-5,7-6,7-7,7-8" },
{ "area": "F1", "data": "2-1 2-3 2-11 2-12" },
{ "area": "B1", "data": "3-1,3-2,4-1,4-2,5-2,6-1,6-2" },
{ "area": "K1", "data": "4-0,5-0,5-1,6-0" },
{ "area": "B2", "data": "8-1,8-2,9-1,9-2" },
{ "area": "B5", "data": "8-4,9-4" },
{ "area": "B7", "data": "7-0,8-0,9-0,10-0,11-0,12-0,13-0" },
{ "area": "B3", "data": "11-1,11-2,12-1,12-2" },
{ "area": "B6", "data": "11-4,12-4" },
{ "area": "B4", "data": "14-2,15-2,16-1,16-2,14-1" },
{ "area": "K3", "data": "16-0,14-0,15-1,15-0" },
{ "area": "E1", "data": "8-5,8-6,8-7,9-5,9-6,9-7,10-5,10-6,10-7,11-5,11-6,11-7,12-5,12-6,12-7" },
{ "area": "D4", "data": "13-4,13-5,13-6,13-7,13-8,14-4,14-5,14-6,14-7,14-8" },
{ "area": "D2", "data": "15-4,15-5,15-6,15-7,15-8,16-4,16-5,16-6,16-7,16-8" },
{ "area": "D3", "data": "17-4,17-8" },
{ "area": "D1", "data": "17-5,17-6,17-7,18-3,18-4,18-5,18-6,18-7,18-8,18-9,19-3,19-4,19-5,19-6,19-7,19-8,19-9" },
{ "area": "C1", "data": "3-10,3-11,4-10,4-11,5-10,6-10,6-11" },
{ "area": "K2", "data": "4-12,5-11,5-12,6-12" },
{ "area": "C2", "data": "8-10,8-11,9-10,9-11" },
{ "area": "C5", "data": "8-8,9-8" },
{ "area": "C7", "data": "7-12,8-12,9-12,10-12,11-12,12-12,13-12" },
{ "area": "C3", "data": "11-10,11-11,12-10,12-11" },
{ "area": "C6", "data": "11-8,12-8" },
{ "area": "C4", "data": "14-10,15-10,16-10,16-11,14-11" },
{ "area": "K4", "data": "14-12,15-12,15-11,16-12" },
{ "area": "K5", "data": "18-11, 19-10, 19-11, 19-20 ,20-11" }
];
*/